In [1]:
import numpy as np
import pandas as pd

### Reshape with negative one,  the other dimensions are automatically calculated.

In [2]:
a = np.zeros(10,2)

TypeError: Cannot interpret '2' as a data type

In [3]:
a = np.zeros((10,2))

In [4]:
a.reshape(4,5)

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [5]:
a.reshape(2,10)

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [6]:
a

array([[0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

In [7]:
x = np.arange(10)
y = np.reshape(x,(5,2))
y

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [8]:
x = np.arange(20)
y = np.reshape(x,(5,2,2))
y

array([[[ 0,  1],
        [ 2,  3]],

       [[ 4,  5],
        [ 6,  7]],

       [[ 8,  9],
        [10, 11]],

       [[12, 13],
        [14, 15]],

       [[16, 17],
        [18, 19]]])

In [9]:
x = np.arange(60)
y = np.reshape(x,(5,2,3,2))
y

array([[[[ 0,  1],
         [ 2,  3],
         [ 4,  5]],

        [[ 6,  7],
         [ 8,  9],
         [10, 11]]],


       [[[12, 13],
         [14, 15],
         [16, 17]],

        [[18, 19],
         [20, 21],
         [22, 23]]],


       [[[24, 25],
         [26, 27],
         [28, 29]],

        [[30, 31],
         [32, 33],
         [34, 35]]],


       [[[36, 37],
         [38, 39],
         [40, 41]],

        [[42, 43],
         [44, 45],
         [46, 47]]],


       [[[48, 49],
         [50, 51],
         [52, 53]],

        [[54, 55],
         [56, 57],
         [58, 59]]]])

### Now trying to reshape with (-1) . Result new shape is (20,) and is compatible with original shape (10,2)

In [10]:
a.reshape(-1)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0.])

In [11]:
a.shape

(10, 2)

### Now trying to reshape with (-1, 1) . We have provided column as 1 but rows as unknown . So we get result new shape as (20, 1).again compatible with original shape(10,2)

In [12]:
a.reshape(-1,1)

array([[0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.],
       [0.]])

### ### Now trying to reshape with (1, -1) . We have provided column as 1 but rows as unknown . So we get result new shape as (1,20).again compatible with original shape(10,2)

In [13]:
a.reshape(1,-1)

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
        0., 0., 0., 0.]])

In [14]:
a.reshape(4,-1)

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [15]:
a.reshape(-1,4)

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

### datatype check

### int8, int16, int32, int64 can be replaced by equivalent string 'i1', 'i2','i4', etc.

In [16]:
dt = np.dtype("i4")
print(dt)

int32

In [17]:
dt1 = np.dtype("i8")
print(dt1)

int64

In [18]:
dt2 = np.dtype("i1")
print(dt2)

int8

In [19]:
dt3 = np.dtype("i2")
print(dt3)

int16

### Column_stack and row_ stack

In [20]:
#numpy.row_stack(tup)
#Stack arrays in sequence vertically (row wise).


a = np.array([1,2,3])
b = np.array([4,5,6])

np.vstack(a,b)

TypeError: _vhstack_dispatcher() takes 1 positional argument but 2 were given

In [21]:
a = np.array([1,2,3])
b = np.array([4,5,6])

np.vstack((a,b))

array([[1, 2, 3],
       [4, 5, 6]])

### p

In [22]:
dt = np.dtype([("age", np.int8)])
a = np.array([(10,), (20,), (30,)], dtype = dt)
print(a["age"])

[10 20 30]

In [23]:
a = np.array([10,20,20])
a

array([10, 20, 20])

In [24]:
a = np.array([(20,),(30,),(40,)])
a

array([[20],
       [30],
       [40]])

In [25]:
dt = np.dtype([("age",np.int8)])
dt

dtype([('age', 'i1')])

In [26]:
dt = np.dtype([("age", np.int8)])
a = np.array([(10,), (20,), (30,)], dtype = dt)
a

array([(10,), (20,), (30,)], dtype=[('age', 'i1')])

In [27]:
a = np.array([1,2,3,4,5], ndmin = 2)
a

array([[1, 2, 3, 4, 5]])

In [136]:
a = np.array([1,2,3,4,5])
a

array([1, 2, 3, 4, 5])

### Which of the following options will print every alternate item from the array below:

In [28]:
arr = np.array([1, 2, 3, 4, 5, 6, 7])
arr

array([1, 2, 3, 4, 5, 6, 7])

In [29]:
arr[:]

array([1, 2, 3, 4, 5, 6, 7])

In [30]:
arr[2:6]

array([3, 4, 5, 6])

In [31]:
arr[::2]

array([1, 3, 5, 7])

### join 2 arrays

In [32]:
a = np.array([[1,2],[3,4]])
b = np.array([[5,6]])

np.concatenate([a,b],axis = 0)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [33]:
a = np.array([[1,2],[3,4]])
b = np.array([[5,6]])

np.concatenate([a,b])

array([[1, 2],
       [3, 4],
       [5, 6]])

In [34]:
a

array([[1, 2],
       [3, 4]])

In [35]:
b.ndim

2

In [36]:
b.shape

(1, 2)

In [37]:
b.T

array([[5],
       [6]])

In [38]:
b.T.shape

(2, 1)

In [39]:
np.concatenate([a,b.T],axis = 1)

array([[1, 2, 5],
       [3, 4, 6]])

### subtraction

In [40]:
a = np.arange(9).reshape((3,3))
b = np.arange(3)

np.subtract(a,b)

array([[0, 0, 0],
       [3, 3, 3],
       [6, 6, 6]])

In [41]:
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [42]:
b

array([0, 1, 2])

### Where

In [43]:
a = np.arange(9).reshape((3,3))
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [44]:
np.where(a<5,0,1)

array([[0, 0, 0],
       [0, 0, 1],
       [1, 1, 1]])

### random

### generate 1000 normally distributed numbers with a mean value of 50 and standard deviation of 0.2?

In [45]:
np.random.randn(5)

array([ 0.65089187, -0.69264782, -0.63580755,  0.31487987, -0.01641115])

In [46]:
np.random.randn(3,4)

array([[ 0.32062066, -1.43082379, -0.85800464,  0.88698775],
       [ 1.30348958,  0.19291787,  0.97835426,  0.97501263],
       [-0.0291324 , -1.54000236, -1.05498212, -0.57004277]])

In [47]:
np.random.normal(size=100, loc=50, scale= 0.2)

array([50.02604472, 49.96193676, 49.88828524, 50.12357845, 50.14160788,
       50.26978536, 49.78484443, 49.89858146, 49.8625966 , 50.10508545,
       50.13960017, 50.03046848, 50.0154583 , 50.00061484, 49.78968474,
       49.97220106, 50.16103288, 49.99276412, 50.23068736, 50.09505187,
       50.08548385, 49.65972182, 49.73430135, 49.89736183, 50.28675531,
       49.88383793, 50.1307614 , 50.20310935, 50.14469571, 50.14869798,
       50.1393064 , 50.07067865, 49.77635284, 49.92442882, 50.13771867,
       49.9477412 , 49.72389059, 50.20550724, 49.92618696, 50.08409697,
       49.7519384 , 50.33788042, 50.14851254, 49.86214773, 49.88470744,
       50.30324551, 50.04184575, 49.80360361, 50.24845931, 50.10151272,
       50.00092947, 50.08059039, 50.06061602, 49.78986184, 50.01979474,
       49.89050235, 50.11546361, 50.3561852 , 49.86448743, 49.81387496,
       49.85363672, 50.15365443, 49.49035022, 50.12904805, 50.05284342,
       50.03475901, 49.88311831, 49.78173372, 50.11065387, 49.67888459,
       49.91478004, 49.64736591, 49.96395754, 49.94458794, 49.80140671,
       49.97796004, 49.95023249, 49.76361574, 49.43747742, 50.54601279,
       49.62983901, 49.96000012, 49.79587764, 49.77359679, 50.06077942,
       50.35705889, 50.19277502, 49.94036063, 50.41018086, 49.97529148,
       49.95488615, 50.36211072, 49.97104547, 49.82499502, 49.66457944,
       49.97424106, 49.96157688, 49.81158114, 50.21187641, 50.06599631])

In [48]:
np.random.normal(50,0.2,100)

array([49.79633359, 49.76959139, 49.97604205, 50.33642783, 49.54784672,
       49.89336276, 49.83816062, 50.0078978 , 50.13597793, 50.05162378,
       49.83053348, 50.19806738, 50.34179744, 49.96433131, 50.16295781,
       50.1140994 , 49.7060137 , 50.05900173, 49.61877312, 49.89555932,
       50.13355754, 49.62433886, 50.13587653, 50.17904897, 50.15856997,
       50.22371343, 49.79662427, 49.88621442, 50.22342967, 49.96184015,
       49.82035927, 49.9001608 , 50.13041467, 49.94580036, 49.98553334,
       49.99475975, 50.37509988, 49.93152093, 50.38073115, 49.8221673 ,
       50.04258938, 50.25103167, 50.10942227, 50.03626157, 50.07444888,
       49.99506   , 49.9791609 , 50.06426184, 50.2503024 , 50.27385204,
       50.12746097, 49.90035974, 49.77970077, 49.96854534, 50.01047498,
       49.81086075, 50.30011836, 49.79278458, 50.16926408, 50.00221855,
       49.94268843, 49.78014987, 49.8362548 , 49.93355358, 49.8027181 ,
       49.85555393, 50.02946854, 49.42481694, 50.07600364, 50.06933789,
       49.80074858, 50.07775361, 49.99929805, 49.96383555, 49.82677219,
       50.00228819, 49.84008805, 49.94339512, 49.53951048, 50.05484383,
       50.19639489, 50.02690861, 49.91287895, 49.99672376, 49.62581508,
       50.2679502 , 49.83318598, 50.56326193, 50.11060118, 50.14717144,
       50.07696555, 49.93378125, 50.1416757 , 50.10212956, 49.81727761,
       50.28045865, 49.95236272, 50.10050423, 49.92570105, 49.54796338])

In [49]:
np.random.normal(50,0.2)

50.082467183525736

In [50]:
np.random.normal(50,0.2,10)

array([50.0482264 , 49.91456006, 50.13609872, 50.23987509, 49.94523293,
       50.25489601, 49.99488661, 49.86079945, 49.9136395 , 50.09725887])

In [51]:
np.random.normal(50,0.2,(2,5))

array([[50.1216475 , 50.15372483, 50.19616049, 49.83614382, 49.93931718],
       [49.77482869, 49.74505888, 50.20357121, 49.84567442, 49.87175703]])

### Pandas

In [52]:
s = pd.Series(np.random.randn(4))
print(s.ndim)

1

In [53]:
np.random.randn(4)

array([ 1.09703324,  0.46277372,  2.07524488, -1.95129811])

In [54]:
s = pd.Series(np.random.randn(4))
s

0    1.098823
1   -1.533800
2   -1.281199
3    0.359773
dtype: float64

### dict to dataframe

In [55]:
data = {
    "one": np.random.rands(5),index = ["a","b","c","d","e"]),
    "two": np.range(4),index=["a","b","c","d"])
}

df = pd.DataFrame(data)
df

SyntaxError: invalid syntax (<ipython-input-55-bb17d943a374>, line 2)

In [56]:
data = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}


df = pd.DataFrame(data)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [57]:
d = pd.Series(5)
d

0    5
dtype: int64

In [58]:
d1 = pd.Series(np.arange(5))
d1

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [59]:
d2 = pd.Series(np.arange(5),index = ["a","b","c","d","e"])
d2

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [60]:
d3 = pd.Series(np.arange(3),index = ["a","b","c","d","e"])
d3

ValueError: Length of passed values is 3, index implies 5.

In [61]:
d3 = pd.Series(np.arange(6),index = ["a","b","c","d","e"])
d3

ValueError: Length of passed values is 6, index implies 5.

### DataFrame.from_dict takes a dict of dicts or a dict of array-like sequences and returns a DataFrame.

In [62]:
data = {
    "col1":[1,2,3],
    "col2":["a","b","c"]
}

df = pd.DataFrame.from_dict(data)
df

   col1 col2
0     1    a
1     2    b
2     3    c

In [63]:
data1 = np.array([("a",1),("b",2),("c",3)])
data1

array([['a', '1'],
       ['b', '2'],
       ['c', '3']], dtype='<U11')

### Convert structured or record ndarray to DataFrame.

### Creates a DataFrame object from a structured ndarray, sequence of tuples or dicts, or DataFrame.

In [71]:
data1 = np.array([('a',1),('b',2),('c',3)],
                dtype=[("Col_1","U1"),("Col_2","i4")])

df=pd.DataFrame.from_records(data1)
df

  Col_1  Col_2
0     a      1
1     b      2
2     c      3

In [69]:
data = np.array([(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')],
                dtype=[('col_1', 'i4'), ('col_2', 'U1')])
pd.DataFrame.from_records(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

# How would you aggregate the data to obtain the
# sum and the average of the “order_amount” aggregated across “state”, “city”, and “user_id”?

In [ ]:
# user_id city state order_id order_amount
# 1 Mumbai Maharashtra 102 8000
# 1 Mumbai Maharashtra 105 7000
# 1 Mumbai Maharashtra 107 2000
# 2 Hyderabad Telengana 101 5000
# 2 Hyderabad Telengana 106 3000
# 2 Hyderabad Telengana 108 4000
# 3 Bangalore Karnataka 104 6000
# 3 Bangalore Karnataka 109 2000
# 4 Mumbai Maharashtra 103 5000
# 4 Mumbai Maharashtra 110 3000

In [74]:
data1 = {
    "user_id": [1,1,1,2,2,2,3,3,4,4],
    "city":["Mumbai","Mumbai","Mumbai","Hyderabad","Hyderabad","Hyderabad","Bangalore","Bangalore","Mumbai","Mumbai"],
    "state":["Maharashtra","Maharashtra","Maharashtra","Telengana","Telengana","Telengana","Karnataka","Karnataka","Maharashtra","Maharashtra"],
    "order_id":[102,105,107,101,106,108,104,109,103,110],
    "order_amount":[8000,7000,2000,5000,3000,4000,6000,2000,5000,3000] 
}

df = pd.DataFrame.from_dict(data1)
df

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [75]:
data1 = {
    "user_id": [1,1,1,2,2,2,3,3,4,4],
    "city":["Mumbai","Mumbai","Mumbai","Hyderabad","Hyderabad","Hyderabad","Bangalore","Bangalore","Mumbai","Mumbai"],
    "state":["Maharashtra","Maharashtra","Maharashtra","Telengana","Telengana","Telengana","Karnataka","Karnataka","Maharashtra","Maharashtra"],
    "order_id":[102,105,107,101,106,108,104,109,103,110],
    "order_amount":[8000,7000,2000,5000,3000,4000,6000,2000,5000,3000] 
}

df = pd.DataFrame(data1)
df

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [79]:
df.groupby(["state","city","user_id"])["order_amount"].agg(["sum","mean"])

                                 sum         mean
state       city      user_id
Karnataka   Bangalore 3         8000  4000.000000
Maharashtra Mumbai    1        17000  5666.666667
                      4         8000  4000.000000
Telengana   Hyderabad 2        12000  4000.000000

In [28]:
table1 = {
    "user_id": [1,2,3,4,],
    "city":["Mumbai","Hyderabad","Bangalore","Mumbai"],
    "state":["Maharashtra","Telengana","Karnataka","Maharashtra"]
}

df1 = pd.DataFrame(table1)
df1

   user_id       city        state
0        1     Mumbai  Maharashtra
1        2  Hyderabad    Telengana
2        3  Bangalore    Karnataka
3        4     Mumbai  Maharashtra

In [29]:
len(df1)

4

In [89]:
table2 = {
    "order_id":[102,105,107,101,106,108,104,109,103,110],
    "user_id": [1,1,1,2,2,2,3,3,4,4],
    "order_amount":[8000,7000,2000,5000,3000,4000,6000,2000,5000,3000]
}

df2 = pd.DataFrame(table2)
df2

   order_id  user_id  order_amount
0       102        1          8000
1       105        1          7000
2       107        1          2000
3       101        2          5000
4       106        2          3000
5       108        2          4000
6       104        3          6000
7       109        3          2000
8       103        4          5000
9       110        4          3000

In [90]:
pd.merge(df1,df2)

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [91]:
pd.merge(df1,df2,how="inner")

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [92]:
pd.merge(df1,df2,how="outer")

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [93]:
pd.merge(df1,df2,how="right")

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [94]:
pd.merge(df1,df2,how="left")

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [95]:
pd.merge(df2,df)

   order_id  user_id  order_amount       city        state
0       102        1          8000     Mumbai  Maharashtra
1       105        1          7000     Mumbai  Maharashtra
2       107        1          2000     Mumbai  Maharashtra
3       101        2          5000  Hyderabad    Telengana
4       106        2          3000  Hyderabad    Telengana
5       108        2          4000  Hyderabad    Telengana
6       104        3          6000  Bangalore    Karnataka
7       109        3          2000  Bangalore    Karnataka
8       103        4          5000     Mumbai  Maharashtra
9       110        4          3000     Mumbai  Maharashtra

In [96]:
pd.merge(df1,df2,on="user_id")

   user_id       city        state  order_id  order_amount
0        1     Mumbai  Maharashtra       102          8000
1        1     Mumbai  Maharashtra       105          7000
2        1     Mumbai  Maharashtra       107          2000
3        2  Hyderabad    Telengana       101          5000
4        2  Hyderabad    Telengana       106          3000
5        2  Hyderabad    Telengana       108          4000
6        3  Bangalore    Karnataka       104          6000
7        3  Bangalore    Karnataka       109          2000
8        4     Mumbai  Maharashtra       103          5000
9        4     Mumbai  Maharashtra       110          3000

In [107]:
df1 = pd.read_csv("end term1.csv")
df1

      ORD_NO  PURCH_AMT     ORD_DATE  CUST_ID  SALES_ID
0      70001     150.50    10/5/2012     3005      5002
1      70009     270.65    9/10/2012     3001      5005
2      70002      65.26    10/5/2012     3002      5001
3   3 70004      110.50    8/17/2012     3009      5003
4      70007     948.50    9/10/2012     3005      5002
5      70005    2400.60    7/27/2012     3007      5001
6      70008    5760.00    9/10/2012     3002      5001
7      70010    1983.43   10/10/2012     3004      5006
8      70003    2480.40   10/10/2012     3009      5003
9      70012     250.45   2012-06-27     3008      5002
10     70011      75.29    8/17/2012     3003      5007
11     70013    3045.60    4/25/2012     3002      5001

In [108]:
df1.columns

Index(['ORD_NO', 'PURCH_AMT', 'ORD_DATE', 'CUST_ID', 'SALES_ID'], dtype='object')

In [122]:
df1["CUST_ID"].value_counts()

3002    3
3009    2
3005    2
3008    1
3001    1
3003    1
3004    1
3007    1
Name: CUST_ID, dtype: int64

In [123]:
df1["SALES_ID"].value_counts()

5001    4
5002    3
5003    2
5005    1
5006    1
5007    1
Name: SALES_ID, dtype: int64

### Write a Python program to split the following dataset grouping on two columns 'CUST_ID' and
### 'SALES_ID'. Then sort sum of “PURCH_AMT” within the groups.

In [128]:
df1.groupby(["CUST_ID","SALES_ID"])["PURCH_AMT"].sum()

CUST_ID  SALES_ID
3001     5005         270.65
3002     5001        8870.86
3003     5007          75.29
3004     5006        1983.43
3005     5002        1099.00
3007     5001        2400.60
3008     5002         250.45
3009     5003        2590.90
Name: PURCH_AMT, dtype: float64

In [130]:
df2 = df1.groupby(["CUST_ID","SALES_ID"])["PURCH_AMT"].sum().reset_index()
df2.sort_values(by="PURCH_AMT",ascending = False)

   CUST_ID  SALES_ID  PURCH_AMT
1     3002      5001    8870.86
7     3009      5003    2590.90
5     3007      5001    2400.60
3     3004      5006    1983.43
4     3005      5002    1099.00
0     3001      5005     270.65
6     3008      5002     250.45
2     3003      5007      75.29

In [133]:
df2 = df1.groupby(["CUST_ID","SALES_ID"])["PURCH_AMT"].sum().reset_index().sort_values(by=["PURCH_AMT"],ascending = False)
df2

   CUST_ID  SALES_ID  PURCH_AMT
1     3002      5001    8870.86
7     3009      5003    2590.90
5     3007      5001    2400.60
3     3004      5006    1983.43
4     3005      5002    1099.00
0     3001      5005     270.65
6     3008      5002     250.45
2     3003      5007      75.29

In [135]:
df2 = df1.groupby(["CUST_ID","SALES_ID"])["PURCH_AMT"].sum().sort_values(ascending = False)
df2

CUST_ID  SALES_ID
3002     5001        8870.86
3009     5003        2590.90
3007     5001        2400.60
3004     5006        1983.43
3005     5002        1099.00
3001     5005         270.65
3008     5002         250.45
3003     5007          75.29
Name: PURCH_AMT, dtype: float64

### Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school

In [143]:
df1 = pd.read_csv("endterm2.csv")
df1

  school  age  height
0   s001   12     173
1   s002   12     192
2   s003   13     186
3   s001   13     167
4   s002   14     151
5   s004   12     159

In [144]:
df1.columns

Index(['school', 'age', 'height'], dtype='object')

In [145]:
df1.groupby(["school"])["age"].agg(["mean","max","min"])

        mean  max  min
school
s001    12.5   13   12
s002    13.0   14   12
s003    13.0   13   13
s004    12.0   12   12

### Join , Merge

In [6]:
df1 = pd.DataFrame({"key":["b","b","a","c","a","a","b"],"data1":range(7)})
df2 = pd.DataFrame({"key":["a","b","a"],"data":range(3)})

print(df1)
print(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
  key  data
0   a     0
1   b     1
2   a     2

In [7]:
pd.merge(df1,df2)

  key  data1  data
0   b      0     1
1   b      1     1
2   b      6     1
3   a      2     0
4   a      2     2
5   a      4     0
6   a      4     2
7   a      5     0
8   a      5     2

In [8]:
pd.merge(df2,df1)

  key  data  data1
0   a     0      2
1   a     0      4
2   a     0      5
3   a     2      2
4   a     2      4
5   a     2      5
6   b     1      0
7   b     1      1
8   b     1      6

In [9]:
pd.merge(df1,df2,on = "key")

  key  data1  data
0   b      0     1
1   b      1     1
2   b      6     1
3   a      2     0
4   a      2     2
5   a      4     0
6   a      4     2
7   a      5     0
8   a      5     2

In [10]:
df1 = pd.DataFrame({"key":["b","b","a","c","a","a","b"],"data1":range(7)})
df2 = pd.DataFrame({"key1":["a","b","a"],"data":range(3)})

pd.merge(df1,df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [15]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

print(df3)
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6
  rkey  data2
0    a      0
1    b      1
2    d      2

In [12]:
pd.merge(df1,df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [13]:
pd.merge(df1,df2,how="inner")

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [17]:
pd.merge(df3,df4,left_on = "lkey",right_on = "rkey") #by dafult inner join

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [18]:
pd.merge(df4,df3,left_on = "lkey",right_on = "rkey")

KeyError: 'rkey'

In [19]:
pd.merge(df4,df3,left_on = "rkey",right_on = "lkey")

  rkey  data2 lkey  data1
0    a      0    a      2
1    a      0    a      4
2    a      0    a      5
3    b      1    b      0
4    b      1    b      1
5    b      1    b      6

In [34]:
pd.merge([df4,df3],left_on = "rkey",right_on = "lkey")

TypeError: merge() missing 1 required positional argument: 'right'

In [21]:
pd.merge(df3,df4,left_on = "lkey",right_on = "rkey",how = "inner") # all b , then all a

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [22]:
pd.merge(df3,df4,left_on = "lkey",right_on = "rkey",how = "outer") # all b , then all a , then c of df3, d of df4

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [23]:
pd.merge(df3,df4,left_on = "lkey",right_on = "rkey",how = "left") # order according to df3 which is left

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [24]:
pd.merge(df3,df4,left_on = "lkey",right_on = "rkey",how = "right") # order according to df4 which is right

  lkey  data1 rkey  data2
0    a    2.0    a      0
1    a    4.0    a      0
2    a    5.0    a      0
3    b    0.0    b      1
4    b    1.0    b      1
5    b    6.0    b      1
6  NaN    NaN    d      2

### Concatenating

In [25]:
arr = np.arange(9).reshape(3,3)
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [27]:
np.concatenate((arr,arr)) #by dafult axis = 0

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [28]:
np.concatenate([arr,arr],axis = 0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [29]:
np.concatenate([arr,arr],axis = 1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [30]:
s1 = pd.Series([0,1])
s1

0    0
1    1
dtype: int64

In [31]:
s1 = pd.Series([0,1],index =  ["a","b"])
s1

a    0
b    1
dtype: int64

In [32]:
s1 = pd.Series([0,1],index =  ["a","b"])
s2 = pd.Series([2,3,4],index =  ["c","d","e"])
s3 = pd.Series([5,6],index =  ["f","g"])

In [33]:
pd.concat(s1,s2,s3)

TypeError: first argument must be an iterable of pandas objects, you passed an object of type "Series"

In [35]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [36]:
pd.concat([s1,s2,s3],axis =0)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [37]:
pd.concat([s1,s2,s3],axis =1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

### Stack unstack

In [38]:
s1 = pd.Series([0,1],index =  ["a","b"])
s2 = pd.Series([2,3,4],index =  ["c","d","e"])
s3 = pd.Series([5,6],index =  ["f","g"])

In [40]:
a = pd.concat([s1,s2,s3],keys = ["x","y"])
a

x  a    0
   b    1
y  c    2
   d    3
   e    4
dtype: int64

In [41]:
b = pd.concat([s1,s2,s3],keys = ["x","y","z"])
b

x  a    0
   b    1
y  c    2
   d    3
   e    4
z  f    5
   g    6
dtype: int64

In [42]:
b = pd.concat([s1,s2,s3],index = ["x","y","z"]) # concat takes keys,not index
b

TypeError: concat() got an unexpected keyword argument 'index'

In [43]:
b.unstack()

     a    b    c    d    e    f    g
x  0.0  1.0  NaN  NaN  NaN  NaN  NaN
y  NaN  NaN  2.0  3.0  4.0  NaN  NaN
z  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [44]:
b.unstack().stack()

x  a    0.0
   b    1.0
y  c    2.0
   d    3.0
   e    4.0
z  f    5.0
   g    6.0
dtype: float64

In [45]:
b["x"]

a    0
b    1
dtype: int64

In [46]:
b["y"]

c    2
d    3
e    4
dtype: int64

In [47]:
b["x"]["a"]

0

### W3Resources

In [3]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [5]:
df = pd.DataFrame.from_dict(student_data)
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [6]:
df = pd.DataFrame.from_records(student_data) # index by default starts with 0
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
0,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
1,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
2,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
3,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
4,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
5,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [12]:
df = pd.DataFrame(student_data)
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [13]:
s = df.groupby(["school_code"])

In [14]:
type(s)

pandas.core.groupby.generic.DataFrameGroupBy

In [15]:
s.get_group("s001")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [16]:
s.get_group("s002")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2

In [59]:
for i , j in s:
    print(i)
    print(j)

s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1
s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [17]:
df.groupby(["school_code"])["age"].agg(["mean","max","mean"])

             mean  max  mean
school_code
s001         12.5   13  12.5
s002         13.0   14  13.0
s003         13.0   13  13.0
s004         12.0   12  12.0

In [20]:
s1 = df.groupby(["school_code","class"])

In [21]:
for i , j in s1:
    print(i)
    print(j)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [23]:
s2 = df.groupby(["school_code"])

In [24]:
list(s2)

[('s001',
     school_code class            name date_Of_Birth   age  height  weight  \
  S1        s001     V  Alberto Franco     15/05/2002   12     173      35
  S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

      address
  S1  street1
  S4  street1  ),
 ('s002',
     school_code class          name date_Of_Birth   age  height  weight  \
  S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
  S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

      address
  S2  street2
  S5  street2  ),
 ('s003',
     school_code class         name date_Of_Birth   age  height  weight  address
  S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3),
 ('s004',
     school_code class          name date_Of_Birth   age  height  weight  \
  S6        s004    VI  David Parkes     15/09/1997   12     159      32

      address
  S6  street4  )]

In [26]:
s3 = df.groupby(["school_code"])
for i , j in s3:
    print(i)
    print(j)

s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1
s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [27]:
s3 = df.groupby(["school_code"])
for i , j in s3:
    print(i)
    print(len(j))

s001
2
s002
2
s003
1
s004
1

In [30]:
s3 = df.groupby(["school_code"])
for i , j in s3:
    print(i)
    print(j.shape[0])

s001
2
s002
2
s003
1
s004
1

In [31]:
s4 =df.groupby(["school_code"])
s4.get_group("s001")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [32]:
s4.get_group("s002")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2

In [33]:
s4.get_group("s003")

   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

In [34]:
s4.get_group("s004")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [35]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [36]:
orders_data.head()

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3005         5002
1   70009     270.65  2012-09-10         3001         5005
2   70002      65.26  2012-10-05         3002         5001
3   70004     110.50  2012-08-17         3009         5003
4   70007     948.50  2012-09-10         3005         5002

In [37]:
orders_data.groupby(["customer_id"])["purch_amt"].agg(["mean","sum","max","min"])

                    mean      sum      max      min
customer_id
3001          270.650000   270.65   270.65   270.65
3002         2956.953333  8870.86  5760.00    65.26
3003           75.290000    75.29    75.29    75.29
3004         1983.430000  1983.43  1983.43  1983.43
3005          549.500000  1099.00   948.50   150.50
3007         2400.600000  2400.60  2400.60  2400.60
3008          250.450000   250.45   250.45   250.45
3009         1295.450000  2590.90  2480.40   110.50

In [41]:
orders_data.groupby(["customer_id"]).agg({"purches_amt":["mean","sum","max","min"]})

KeyError: "Column 'purches_amt' does not exist!"

In [40]:
orders_data.groupby(["customer_id"]).agg({"purch_amt":["mean","sum","max","min"]})

               purch_amt
                    mean      sum      max      min
customer_id
3001          270.650000   270.65   270.65   270.65
3002         2956.953333  8870.86  5760.00    65.26
3003           75.290000    75.29    75.29    75.29
3004         1983.430000  1983.43  1983.43  1983.43
3005          549.500000  1099.00   948.50   150.50
3007         2400.600000  2400.60  2400.60  2400.60
3008          250.450000   250.45   250.45   250.45
3009         1295.450000  2590.90  2480.40   110.50

In [45]:
orders_data["purch_amt"].groupby(orders_data["customer_id"]).agg(["mean","max","min"])

                    mean      max      min
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333  5760.00    65.26
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   948.50   150.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000  2480.40   110.50

KeyError: 'customer_id'

In [47]:
orders_data.groupby(by = ["customer_id"])["purch_amt"].agg(["mean","sum","max","min"])

                    mean      sum      max      min
customer_id
3001          270.650000   270.65   270.65   270.65
3002         2956.953333  8870.86  5760.00    65.26
3003           75.290000    75.29    75.29    75.29
3004         1983.430000  1983.43  1983.43  1983.43
3005          549.500000  1099.00   948.50   150.50
3007         2400.600000  2400.60  2400.60  2400.60
3008          250.450000   250.45   250.45   250.45
3009         1295.450000  2590.90  2480.40   110.50

In [48]:
orders_data.groupby(["customer_id"])["purch_amt"].agg(["mean","sum","max","min"]).iloc[:3]

                    mean      sum      max     min
customer_id
3001          270.650000   270.65   270.65  270.65
3002         2956.953333  8870.86  5760.00   65.26
3003           75.290000    75.29    75.29   75.29

In [49]:
orders_data.groupby(["customer_id"])["purch_amt"].agg(["mean","sum","max","min"]).loc[:3003]

                    mean      sum      max     min
customer_id
3001          270.650000   270.65   270.65  270.65
3002         2956.953333  8870.86  5760.00   65.26
3003           75.290000    75.29    75.29   75.29

In [50]:
a = orders_data.groupby(["customer_id"])["purch_amt"].agg(["mean","sum","max","min"])

In [54]:
a

                    mean      sum      max      min
customer_id
3001          270.650000   270.65   270.65   270.65
3002         2956.953333  8870.86  5760.00    65.26
3003           75.290000    75.29    75.29    75.29
3004         1983.430000  1983.43  1983.43  1983.43
3005          549.500000  1099.00   948.50   150.50
3007         2400.600000  2400.60  2400.60  2400.60
3008          250.450000   250.45   250.45   250.45
3009         1295.450000  2590.90  2480.40   110.50

In [55]:
type(a)

pandas.core.frame.DataFrame

In [56]:
a[a["sum"]>1000]

                    mean      sum      max      min
customer_id
3002         2956.953333  8870.86  5760.00    65.26
3004         1983.430000  1983.43  1983.43  1983.43
3005          549.500000  1099.00   948.50   150.50
3007         2400.600000  2400.60  2400.60  2400.60
3009         1295.450000  2590.90  2480.40   110.50

In [58]:
a[~(a["sum"]>1000)]

               mean     sum     max     min
customer_id
3001         270.65  270.65  270.65  270.65
3003          75.29   75.29   75.29   75.29
3008         250.45  250.45  250.45  250.45

In [59]:
a[~(a["sum"]>1000)].sort_values(ascending = False)

TypeError: sort_values() missing 1 required positional argument: 'by'

In [60]:
a[~(a["sum"]>1000)].sort_values(by = "sum",ascending = False)

               mean     sum     max     min
customer_id
3001         270.65  270.65  270.65  270.65
3008         250.45  250.45  250.45  250.45
3003          75.29   75.29   75.29   75.29

In [61]:
a[~(a["sum"]>1000)].sort_values(by = "mean",ascending = False)

               mean     sum     max     min
customer_id
3001         270.65  270.65  270.65  270.65
3008         250.45  250.45  250.45  250.45
3003          75.29   75.29   75.29   75.29

### Numpy Practices

In [1]:
# numpy stands for numerical python

In [2]:
# Numpy developed by Travis Oliphant

In [3]:
import numpy as np

### numpy.column_stack() (vertical stack) function is used to stack 1-D arrays as columns into a 2-D array.

In [14]:
arr = np.array([1,2,3])
arr2 = np.array([4,5,6])
np.column_stack((arr,arr2))

array([[1, 4],
       [2, 5],
       [3, 6]])

In [6]:
np.row_stack((arr,arr2))

array([[1, 2, 3],
       [4, 5, 6]])

In [16]:
v = np.vstack((arr,arr2))
v

array([[1, 2, 3],
       [4, 5, 6]])

In [12]:
v.shape

(2, 3)

In [9]:
np.hstack((arr,arr2))

array([1, 2, 3, 4, 5, 6])

In [17]:
# An array class in Numpy is called as ndarray

# The first character specifies the kind of data and the remaining characters specify the number of bytes per item, 
# except for Unicode,
m - timedelta
M  - Datetime
U - unicode string
i  - signed integer
u - unsigned integer
f - floating point

### The numpy.ones_like() function returns an array of given shape and type as a given array, with ones.

In [74]:
arr = np.ones((3,2))
arr

array([[1., 1.],
       [1., 1.],
       [1., 1.]])

In [19]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype=float)

array([[1., 1.],
       [1., 1.],
       [1., 1.]])

In [20]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype=int)

array([[1, 1],
       [1, 1],
       [1, 1]])

In [21]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype='int')

array([[1, 1],
       [1, 1],
       [1, 1]])

In [22]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype='i4')

array([[1, 1],
       [1, 1],
       [1, 1]])

In [23]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype='U')

array([['1', '1'],
       ['1', '1'],
       ['1', '1']], dtype='<U1')

In [24]:
arr = np.array([[2,3],[4,5],[6,7]])
np.ones_like(arr,dtype='f')

array([[1., 1.],
       [1., 1.],
       [1., 1.]], dtype=float32)

### iscomplex

### The numpy.iscomplex() function tests element-wise whether it is a complex number or not(not infinity or not Not a Number) and 
returns the result as a boolean array.

In [26]:
arr = np.array(np.arange(9)).reshape(3,3)
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [27]:
np.iscomplex(arr)

array([[False, False, False],
       [False, False, False],
       [False, False, False]])

In [29]:
arr2 = np.arange(20).reshape(5,4).dtype=complex
arr2

complex

In [31]:
np.iscomplex(arr2)

False

In [32]:
a = np.array([1,2,3],dtype = complex)
a

array([1.+0.j, 2.+0.j, 3.+0.j])

In [33]:
### syntax for dtype object 
# np.dtype(object,align,copy)

In [34]:
# np.arary(object,dtype=None,copy=True, order=None ,subok=False, ndmin=0)

In [47]:
a = np.array([1,2,3,5,8])
b = np.array([0,3,4,2,1])
c = a + b
c = c*a
print(c[3])

35

In [48]:
arr = np.array([1,2,3,5,8])
arr = arr +1
print(arr[1])

3

### Full function

In [59]:
arr = np.ones(3)
arr

array([1., 1., 1.])

In [60]:
arr2 = np.ones((3,3))
arr2

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [62]:
arr3 = np.full([1,4],98)
arr3

array([[98, 98, 98, 98]])

In [64]:
arr3.ndim

2

In [63]:
arr4 =  np.full((1,8),90)
arr4

array([[90, 90, 90, 90, 90, 90, 90, 90]])

In [65]:
arr5 = np.full((2,5),80)
arr5

array([[80, 80, 80, 80, 80],
       [80, 80, 80, 80, 80]])

In [66]:
arr6 = np.full((2,3),45,dtype = float)
arr6

array([[45., 45., 45.],
       [45., 45., 45.]])

In [67]:
### The numpy.reshape() function shapes an array without changing the data of the array.

# Syntax: numpy.reshape(array, shape, order = 'C')

In [69]:
a = np.array([[1,2,3],[0,1,4]])
b = np.zeros((2,3),dtype = np.int16)
c = np.ones((2,3),dtype = np.int16)
d = a+b+c
print(d[1,2])

5

In [70]:
print(d[1][2])

5

# Pandas

In [75]:
# Pandas = Panel Data

In [76]:
# pandas developed by Wes Macciney

In [77]:
import pandas as pd

In [80]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [83]:
df.set_index("school_code")

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

In [86]:
df.set_index("t_id")

     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

### Write a Pandas program to create a multi Index frame using two columns

In [87]:
df.set_index(["school_code","t_id"])

                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4

###  using an Index and a column.

In [97]:
df.set_index([pd.Index([1,2,3,4,5,6]),"t_id"])

       school_code class            name date_Of_Birth  weight  address
  t_id
1 t1          s001     V  Alberto Franco    15/05/2002      35  street1
2 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
3 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
4 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
5 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
6 t6          s004    VI    David Parkes    15/09/1997      32  street4

In [96]:
df.set_index(["school_code","t_id"])

                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4

### Write a Pandas program to create a dataframe and set a title or name of the index column.

In [98]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [103]:
df.index.name="Sl. No"
df

       school_code class            name date_Of_Birth  weight  address t_id
Sl. No
0             s001     V  Alberto Franco    15/05/2002      35  street1   t1
1             s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2             s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3             s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4             s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5             s004    VI    David Parkes    15/09/1997      32  street4   t6

### Write a Pandas program to convert index of a given dataframe into a column

In [110]:
df

       school_code class            name date_Of_Birth  weight  address t_id
Sl. No
0             s001     V  Alberto Franco    15/05/2002      35  street1   t1
1             s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2             s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3             s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4             s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5             s004    VI    David Parkes    15/09/1997      32  street4   t6

In [111]:
df.reset_index("Sl. No")

,Sl. No,school_code,class,name,date_Of_Birth,weight,address,t_id
0,0,s001,V,Alberto Franco,15/05/2002,35,street1,t1
1,1,s002,V,Gino Mcneill,17/05/2002,32,street2,t2
2,2,s003,VI,Ryan Parkes,16/02/1999,33,street3,t3
3,3,s001,VI,Eesha Hinton,25/09/1998,30,street1,t4
4,4,s002,V,Gino Mcneill,11/05/2002,31,street2,t5
5,5,s004,VI,David Parkes,15/09/1997,32,street4,t6

In [117]:
df.reset_index("Sl. No",drop = True,inplace = True)

In [123]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [131]:
df.set_index("t_id")

     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

In [134]:
df.reset_index(drop=True,inplace=True)

In [135]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

### Write a Pandas program to extract a single row, rows and a specific value from a MultiIndex levels DataFrame.

In [136]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

In [137]:
zip(sales_arrays)

In [138]:
list(zip(sales_arrays))

[(['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],),
 (['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2'],)]

In [143]:
sales_tuples = list(zip(*sales_arrays))
sales_tuples

[('sale1', 'city1'),
 ('sale1', 'city2'),
 ('sale2', 'city1'),
 ('sale2', 'city2'),
 ('sale3', 'city1'),
 ('sale3', 'city2'),
 ('sale4', 'city1'),
 ('sale4', 'city2')]

In [141]:
zip(*sales_arrays)

In [146]:
sales_index = pd.MultiIndex.from_tuples(sales_tuples,name = ["sale","city"])
sales_index

MultiIndex([('sale1', 'city1'),
            ('sale1', 'city2'),
            ('sale2', 'city1'),
            ('sale2', 'city2'),
            ('sale3', 'city1'),
            ('sale3', 'city2'),
            ('sale4', 'city1'),
            ('sale4', 'city2')],
           names=['sale', 'city'])

In [150]:
df = pd.DataFrame(np.random.randn(8),index = sales_index)
df

                    0
sale  city
sale1 city1  0.000135
      city2  0.016807
sale2 city1 -0.273541
      city2  1.244576
sale3 city1 -1.429015
      city2 -1.896232
sale4 city1 -1.166451
      city2  0.678491

In [151]:
df = pd.DataFrame(np.random.randn(8,5),index = sales_index)
df

                    0         1         2         3         4
sale  city
sale1 city1 -0.017854 -0.490473 -1.220600  0.321417 -0.703753
      city2 -0.272112 -1.218589 -0.843945  0.471156  1.485056
sale2 city1  0.883631  0.423855  0.429790  0.709724  0.404628
      city2  0.531040 -2.009606 -0.449063 -1.998538  1.523521
sale3 city1  0.332266 -0.102035  0.876692 -0.463690 -0.066176
      city2  0.549781  0.624745  1.221881  1.504490  1.120822
sale4 city1 -0.089305  0.408549 -2.094537 -0.430575  0.897221
      city2  0.925587 -2.166715 -1.712830  1.063464  0.431371

In [152]:
df = pd.DataFrame(np.random.randn(8,),index = sales_index)
df

                    0
sale  city
sale1 city1  0.980438
      city2 -0.669858
sale2 city1  1.095821
      city2  0.319253
sale3 city1  0.085186
      city2  0.681311
sale4 city1  0.428021
      city2  0.277353

In [154]:
df = pd.DataFrame(np.random.randn(8,4),index = sales_index)
df

                    0         1         2         3
sale  city
sale1 city1  1.489428  1.681865  0.609934 -1.111684
      city2  0.614082 -0.977747  0.170769 -0.328136
sale2 city1  0.775740  0.172656  0.392329 -0.715989
      city2 -0.870291  1.064491  0.020261 -0.924920
sale3 city1 -0.429802  1.316459 -0.864268  1.632090
      city2  0.072260  0.682476 -0.012371 -0.371458
sale4 city1 -0.389541  1.413702 -0.630127 -0.499093
      city2 -1.363603  1.258422 -1.341607  0.078800

### Write a Pandas program to sort a MultiIndex of a DataFrame. Also sort on various levels of index.

In [155]:
sales_arrays = [['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_arrays

[['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
 ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

In [156]:
sales_tuples = list(zip(*sales_arrays))
sales_tuples

[('sale1', 'city1'),
 ('sale1', 'city2'),
 ('sale3', 'city1'),
 ('sale3', 'city2'),
 ('sale2', 'city1'),
 ('sale2', 'city2'),
 ('sale4', 'city1'),
 ('sale4', 'city2')]

In [167]:
sales_index = pd.MultiIndex.from_tuples(sales_tuples,names = ["sale","city"])
sales_index

MultiIndex([('sale1', 'city1'),
            ('sale1', 'city2'),
            ('sale3', 'city1'),
            ('sale3', 'city2'),
            ('sale2', 'city1'),
            ('sale2', 'city2'),
            ('sale4', 'city1'),
            ('sale4', 'city2')],
           names=['sale', 'city'])

In [168]:
df = pd.DataFrame(np.random.randn(8,5),index = sales_index)
df

                    0         1         2         3         4
sale  city
sale1 city1 -0.840238  0.199453  0.601240 -0.569079  0.561739
      city2  1.696404 -1.435471  0.542372  1.045547  0.415053
sale3 city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
      city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
sale2 city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
      city2  0.085588  0.294117  0.383441 -0.160333  0.591678
sale4 city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
      city2 -0.525807  0.708585  0.299144  0.425788  0.660616

In [169]:
df.sort_index(ascending=False)

                    0         1         2         3         4
sale  city
sale4 city2 -0.525807  0.708585  0.299144  0.425788  0.660616
      city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
sale3 city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
      city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
sale2 city2  0.085588  0.294117  0.383441 -0.160333  0.591678
      city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
sale1 city2  1.696404 -1.435471  0.542372  1.045547  0.415053
      city1 -0.840238  0.199453  0.601240 -0.569079  0.561739

In [170]:
df.sort_index(level = 0)

                    0         1         2         3         4
sale  city
sale1 city1 -0.840238  0.199453  0.601240 -0.569079  0.561739
      city2  1.696404 -1.435471  0.542372  1.045547  0.415053
sale2 city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
      city2  0.085588  0.294117  0.383441 -0.160333  0.591678
sale3 city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
      city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
sale4 city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
      city2 -0.525807  0.708585  0.299144  0.425788  0.660616

In [171]:
df.sort_index(level = 1)

                    0         1         2         3         4
sale  city
sale1 city1 -0.840238  0.199453  0.601240 -0.569079  0.561739
sale2 city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
sale3 city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
sale4 city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
sale1 city2  1.696404 -1.435471  0.542372  1.045547  0.415053
sale2 city2  0.085588  0.294117  0.383441 -0.160333  0.591678
sale3 city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
sale4 city2 -0.525807  0.708585  0.299144  0.425788  0.660616

In [172]:
df.sort_index(level = "city")

                    0         1         2         3         4
sale  city
sale1 city1 -0.840238  0.199453  0.601240 -0.569079  0.561739
sale2 city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
sale3 city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
sale4 city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
sale1 city2  1.696404 -1.435471  0.542372  1.045547  0.415053
sale2 city2  0.085588  0.294117  0.383441 -0.160333  0.591678
sale3 city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
sale4 city2 -0.525807  0.708585  0.299144  0.425788  0.660616

In [173]:
df.sort_index(level = 0, ascending=False)

                    0         1         2         3         4
sale  city
sale4 city2 -0.525807  0.708585  0.299144  0.425788  0.660616
      city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
sale3 city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
      city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
sale2 city2  0.085588  0.294117  0.383441 -0.160333  0.591678
      city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
sale1 city2  1.696404 -1.435471  0.542372  1.045547  0.415053
      city1 -0.840238  0.199453  0.601240 -0.569079  0.561739

In [174]:
df.sort_index(level = 1,ascending = False)

                    0         1         2         3         4
sale  city
sale4 city2 -0.525807  0.708585  0.299144  0.425788  0.660616
sale3 city2 -0.777594 -0.175065 -0.766809  0.526797 -1.355802
sale2 city2  0.085588  0.294117  0.383441 -0.160333  0.591678
sale1 city2  1.696404 -1.435471  0.542372  1.045547  0.415053
sale4 city1 -0.176173 -0.328539 -1.476290 -1.846331  0.125343
sale3 city1 -0.496966  0.711159  0.106417  1.582069 -0.140884
sale2 city1  0.543333  0.793145 -0.600099  1.507499 -0.440481
sale1 city1 -0.840238  0.199453  0.601240 -0.569079  0.561739

In [175]:
df.sort_index(level = 0,ascending = False,level = 1,ascending = True)

SyntaxError: keyword argument repeated (<ipython-input-175-2e71033bf55c>, line 1)

### Pandas Joining and merging

#Write a Pandas program to join the two given dataframes along rows and assign all data

In [177]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [178]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [179]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [181]:
pd.concat([student_data1,student_data2])

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [194]:
student_data1+student_data2

  student_id                              name  marks
0       S1S4  Danniella FentonScarlette Fisher    401
1       S2S5      Ryder StoreyCarla Williamson    410
2       S3S6           Bryce JensenDante Morse    388
3       S4S7           Ed BernalKaiser William    441
4       S5S8        Kwame MorinMadeeha Preston    400

In [182]:
pd.concat([student_data1,student_data2],ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

In [185]:
pd.merge(student_data1,student_data2)

Empty DataFrame
Columns: [student_id, name, marks]
Index: []

In [186]:
pd.merge(student_data1,student_data2,on="student_id")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

In [189]:
df = pd.concat([student_data1,student_data2],keys = ["student1","student2"])
df

           student_id              name  marks
student1 0         S1  Danniella Fenton    200
         1         S2      Ryder Storey    210
         2         S3      Bryce Jensen    190
         3         S4         Ed Bernal    222
         4         S5       Kwame Morin    199
student2 0         S4  Scarlette Fisher    201
         1         S5  Carla Williamson    200
         2         S6       Dante Morse    198
         3         S7    Kaiser William    219
         4         S8   Madeeha Preston    201

In [190]:
df.iloc[1:4]

           student_id          name  marks
student1 1         S2  Ryder Storey    210
         2         S3  Bryce Jensen    190
         3         S4     Ed Bernal    222

In [193]:
df.iloc[1:4]+df.iloc[6:9]

           student_id name  marks
student1 1        NaN  NaN    NaN
         2        NaN  NaN    NaN
         3        NaN  NaN    NaN
student2 1        NaN  NaN    NaN
         2        NaN  NaN    NaN
         3        NaN  NaN    NaN

In [197]:
d1 = pd.concat([student_data1,student_data2])
d1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [198]:
d1.set_index("student_id")

                        name  marks
student_id
S1          Danniella Fenton    200
S2              Ryder Storey    210
S3              Bryce Jensen    190
S4                 Ed Bernal    222
S5               Kwame Morin    199
S4          Scarlette Fisher    201
S5          Carla Williamson    200
S6               Dante Morse    198
S7            Kaiser William    219
S8           Madeeha Preston    201

### Write a Pandas program to append rows to an existing DataFrame and display the combined data.

In [199]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

In [200]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [203]:
s6 = pd.Series(["S6","Preetam Saha",250])
s6

0              S6
1    Preetam Saha
2             250
dtype: object

In [204]:
s6 = pd.Series(["S6","Preetam Saha",250],index=["student_id","name","marks"])
s6

student_id              S6
name          Preetam Saha
marks                  250
dtype: object

In [205]:
pd.concat(student_data1,s6)

TypeError: first argument must be an iterable of pandas objects, you passed an object of type "DataFrame"

In [206]:
pd.DataFrame(s6)

                       0
student_id            S6
name        Preetam Saha
marks                250

In [210]:
s6_T = pd.DataFrame(s6).T
s6_T

  student_id          name marks
0         S6  Preetam Saha   250

In [213]:
pd.concat([student_data1,s6_T],ignore_index=True)

  student_id              name marks
0         S1  Danniella Fenton   200
1         S2      Ryder Storey   210
2         S3      Bryce Jensen   190
3         S4         Ed Bernal   222
4         S5       Kwame Morin   199
5         S6      Preetam Saha   250

In [214]:
student_data1.append(s6_T)

  student_id              name marks
0         S1  Danniella Fenton   200
1         S2      Ryder Storey   210
2         S3      Bryce Jensen   190
3         S4         Ed Bernal   222
4         S5       Kwame Morin   199
0         S6      Preetam Saha   250

In [215]:
student_data1.append(s6)

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [216]:
student_data1.append(s6,ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6      Preetam Saha    250

### Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [218]:
pd.merge(student_data1,student_data2,on = "student_id")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

In [219]:
pd.merge(student_data1,student_data2,on = "student_id",how = "inner")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

### Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [221]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print(data1)
print(data2)

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [222]:
pd.merge(data1,data2,on=["key1"])

  key1 key2_x   P   Q key2_y   R   S
0   K0     K0  P0  Q0     K0  R0  S0
1   K0     K1  P1  Q1     K0  R0  S0
2   K1     K0  P2  Q2     K0  R1  S1
3   K1     K0  P2  Q2     K0  R2  S2
4   K2     K1  P3  Q3     K0  R3  S3

In [223]:
pd.merge(data1,data2,on=["key2"])

  key1_x key2   P   Q key1_y   R   S
0     K0   K0  P0  Q0     K0  R0  S0
1     K0   K0  P0  Q0     K1  R1  S1
2     K0   K0  P0  Q0     K1  R2  S2
3     K0   K0  P0  Q0     K2  R3  S3
4     K1   K0  P2  Q2     K0  R0  S0
5     K1   K0  P2  Q2     K1  R1  S1
6     K1   K0  P2  Q2     K1  R2  S2
7     K1   K0  P2  Q2     K2  R3  S3

In [224]:
pd.merge(data1,data2)

  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

In [225]:
pd.merge(data1,data2,on = ["key1","key2"],how = "left")

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

### 9. Write a Pandas program to join two dataframes using keys from right dataframe only.

In [226]:
pd.merge(data1,data2,on = ["key1","key2"],how = "right")

  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

In [227]:
pd.merge(data1,data2,on = ["key1","key2"],how = "right",index = "Joining_index")

TypeError: merge() got an unexpected keyword argument 'index'

In [228]:
d1 = pd.merge(data1,data2,on = ["key1","key2"],how = "right")

In [231]:
d1.index.name = "Joining_index"
d1

              key1 key2    P    Q   R   S
Joining_index
0               K0   K0   P0   Q0  R0  S0
1               K1   K0   P2   Q2  R1  S1
2               K1   K0   P2   Q2  R2  S2
3               K2   K0  NaN  NaN  R3  S3

In [232]:
d2 = d1.set_index("key1")
d2

     key2    P    Q   R   S
key1
K0     K0   P0   Q0  R0  S0
K1     K0   P2   Q2  R1  S1
K1     K0   P2   Q2  R2  S2
K2     K0  NaN  NaN  R3  S3

In [235]:
d2.reset_index(inplace = True)

In [236]:
d2

  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

### Write a Pandas program to combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [237]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [238]:
data1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [239]:
data2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [242]:
pd.merge(data1,data2,left_index=True,right_index=True,how = "inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [247]:
pd.merge(data1,data2,ignore_index=True,how = "inner")

TypeError: merge() got an unexpected keyword argument 'ignore_index'

In [243]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key3': ['K0', 'K1', 'K1', 'K2'],
                      'key4': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

In [244]:
data1

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

In [245]:
data2

  key3 key4   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [246]:
pd.merge(data1,data2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [248]:
pd.merge(data1,data2,left_on = ["key1","key2"],right_on=["key3","key4"],how = "inner")

  key1 key2   P   Q key3 key4   R   S
0   K0   K0  P0  Q0   K0   K0  R0  S0
1   K1   K0  P2  Q2   K1   K0  R1  S1
2   K1   K0  P2  Q2   K1   K0  R2  S2

### Group by

### Write a Pandas program to split a dataset to group by two columns and count by each row.

In [250]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [251]:
orders_data

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [259]:
orders_data.groupby(["salesman_id","customer_id"])["ord_no"].value_counts()

salesman_id  customer_id  ord_no
5001         3002         70002     1
                          70008     1
                          70013     1
             3007         70005     1
5002         3005         70001     1
                          70007     1
             3008         70012     1
5003         3009         70003     1
                          70004     1
5005         3001         70009     1
5006         3004         70010     1
5007         3003         70011     1
Name: ord_no, dtype: int64

In [260]:
orders_data.groupby(["salesman_id","customer_id"])["ord_no"].size()

salesman_id  customer_id
5001         3002           3
             3007           1
5002         3005           2
             3008           1
5003         3009           2
5005         3001           1
5006         3004           1
5007         3003           1
Name: ord_no, dtype: int64

### Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.

In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups

In [261]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [262]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001

In [285]:
df.sort_values(["customer_id","salesman_id"])

    ord_no  purch_amt    ord_date  customer_id  salesman_id
5    70005    2400.60  2012-07-27         3001         5001
0    70001     150.50  2012-10-05         3001         5002
9    70012     250.45  2012-06-27         3001         5002
3    70004     110.50  2012-08-17         3001         5003
1    70009     270.65  2012-09-10         3001         5005
7    70010    1983.43  2012-10-10         3001         5006
2    70002      65.26  2012-10-05         3005         5001
6    70008    5760.00  2012-09-10         3005         5001
11   70013    3045.60  2012-04-25         3005         5001
4    70007     948.50  2012-09-10         3005         5002
8    70003    2480.40  2012-10-10         3005         5003
10   70011      75.29  2012-08-17         3005         5007

In [288]:
df.sort_values(["purch_amt","salesman_id"])

    ord_no  purch_amt    ord_date  customer_id  salesman_id
2    70002      65.26  2012-10-05         3005         5001
10   70011      75.29  2012-08-17         3005         5007
3    70004     110.50  2012-08-17         3001         5003
0    70001     150.50  2012-10-05         3001         5002
9    70012     250.45  2012-06-27         3001         5002
1    70009     270.65  2012-09-10         3001         5005
4    70007     948.50  2012-09-10         3005         5002
7    70010    1983.43  2012-10-10         3001         5006
5    70005    2400.60  2012-07-27         3001         5001
8    70003    2480.40  2012-10-10         3005         5003
11   70013    3045.60  2012-04-25         3005         5001
6    70008    5760.00  2012-09-10         3005         5001

In [289]:
df.sort_values(["purch_amt","salesman_id"],ascending = False)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  2012-09-10         3005         5001
11   70013    3045.60  2012-04-25         3005         5001
8    70003    2480.40  2012-10-10         3005         5003
5    70005    2400.60  2012-07-27         3001         5001
7    70010    1983.43  2012-10-10         3001         5006
4    70007     948.50  2012-09-10         3005         5002
1    70009     270.65  2012-09-10         3001         5005
9    70012     250.45  2012-06-27         3001         5002
0    70001     150.50  2012-10-05         3001         5002
3    70004     110.50  2012-08-17         3001         5003
10   70011      75.29  2012-08-17         3005         5007
2    70002      65.26  2012-10-05         3005         5001

In [294]:
df.sort_values(["purch_amt"],ascending = False).groupby("customer_id").head()

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  2012-09-10         3005         5001
11   70013    3045.60  2012-04-25         3005         5001
8    70003    2480.40  2012-10-10         3005         5003
5    70005    2400.60  2012-07-27         3001         5001
7    70010    1983.43  2012-10-10         3001         5006
4    70007     948.50  2012-09-10         3005         5002
1    70009     270.65  2012-09-10         3001         5005
9    70012     250.45  2012-06-27         3001         5002
0    70001     150.50  2012-10-05         3001         5002
10   70011      75.29  2012-08-17         3005         5007

In [293]:
df.sort_values(["purch_amt","salesman_id"],ascending = False).groupby(["customer_id","salesman_id"]).head()

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  2012-09-10         3005         5001
11   70013    3045.60  2012-04-25         3005         5001
8    70003    2480.40  2012-10-10         3005         5003
5    70005    2400.60  2012-07-27         3001         5001
7    70010    1983.43  2012-10-10         3001         5006
4    70007     948.50  2012-09-10         3005         5002
1    70009     270.65  2012-09-10         3001         5005
9    70012     250.45  2012-06-27         3001         5002
0    70001     150.50  2012-10-05         3001         5002
3    70004     110.50  2012-08-17         3001         5003
10   70011      75.29  2012-08-17         3005         5007
2    70002      65.26  2012-10-05         3005         5001

In [266]:
df.groupby(["salesman_id","customer_id"])["purch_amt"].agg(["sum"])

                             sum
salesman_id customer_id
5001        3001         2400.60
            3005         8870.86
5002        3001          400.95
            3005          948.50
5003        3001          110.50
            3005         2480.40
5005        3001          270.65
5006        3001         1983.43
5007        3005           75.29

In [268]:
df.groupby(["salesman_id","customer_id"])["purch_amt"].agg(["sum"]).sort_values(by = "sum" )

                             sum
salesman_id customer_id
5007        3005           75.29
5003        3001          110.50
5005        3001          270.65
5002        3001          400.95
            3005          948.50
5006        3001         1983.43
5001        3001         2400.60
5003        3005         2480.40
5001        3005         8870.86

In [269]:
df.groupby(["salesman_id","customer_id"])["purch_amt"].agg(["sum"]).sort_values(by = "salesman_id" )

                             sum
salesman_id customer_id
5001        3001         2400.60
            3005         8870.86
5002        3001          400.95
            3005          948.50
5003        3001          110.50
            3005         2480.40
5005        3001          270.65
5006        3001         1983.43
5007        3005           75.29

In [273]:
df.groupby(["salesman_id","customer_id"])["purch_amt"].agg({"purch_amt1":"sum"})

SpecificationError: nested renamer is not supported

In [272]:
df.groupby(["salesman_id","customer_id"]).agg({"purch_amt":"sum"})

                         purch_amt
salesman_id customer_id
5001        3001           2400.60
            3005           8870.86
5002        3001            400.95
            3005            948.50
5003        3001            110.50
            3005           2480.40
5005        3001            270.65
5006        3001           1983.43
5007        3005             75.29

In [274]:
df.groupby(["salesman_id","customer_id"]).agg({"purch_amt":"sum"}).sort_values(by = "purch_amt")

                         purch_amt
salesman_id customer_id
5007        3005             75.29
5003        3001            110.50
5005        3001            270.65
5002        3001            400.95
            3005            948.50
5006        3001           1983.43
5001        3001           2400.60
5003        3005           2480.40
5001        3005           8870.86

In [278]:
df1 = df.groupby(["salesman_id","customer_id"]).agg({"purch_amt":"sum"})
df1

                         purch_amt
salesman_id customer_id
5001        3001           2400.60
            3005           8870.86
5002        3001            400.95
            3005            948.50
5003        3001            110.50
            3005           2480.40
5005        3001            270.65
5006        3001           1983.43
5007        3005             75.29

In [282]:
df2 = df1["purch_amt"].groupby(level =0,group_keys = False)
df2

In [284]:
df2.nlargest()

salesman_id  customer_id
5001         3005           8870.86
             3001           2400.60
5002         3005            948.50
             3001            400.95
5003         3005           2480.40
             3001            110.50
5005         3001            270.65
5006         3001           1983.43
5007         3005             75.29
Name: purch_amt, dtype: float64

In [295]:
df_gr = df.groupby(["customer_id","salesman_id"]).agg({"purch_amt":"sum"})
df_gr

                         purch_amt
customer_id salesman_id
3001        5001           2400.60
            5002            400.95
            5003            110.50
            5005            270.65
            5006           1983.43
3005        5001           8870.86
            5002            948.50
            5003           2480.40
            5007             75.29

In [323]:
df_gr.groupby(["customer_id","salesman_id"])["purch_amt"].agg("sum")

customer_id  salesman_id
3001         5001           2400.60
             5002            400.95
             5003            110.50
             5005            270.65
             5006           1983.43
3005         5001           8870.86
             5002            948.50
             5003           2480.40
             5007             75.29
Name: purch_amt, dtype: float64

In [306]:
df = df_gr["purch_amt"].groupby("customer_id").head()
df

customer_id  salesman_id
3001         5001           2400.60
             5002            400.95
             5003            110.50
             5005            270.65
             5006           1983.43
3005         5001           8870.86
             5002            948.50
             5003           2480.40
             5007             75.29
Name: purch_amt, dtype: float64

In [305]:
df = df_gr["purch_amt"].groupby("customer_id",group_keys=False).head()
df

customer_id  salesman_id
3001         5001           2400.60
             5002            400.95
             5003            110.50
             5005            270.65
             5006           1983.43
3005         5001           8870.86
             5002            948.50
             5003           2480.40
             5007             75.29
Name: purch_amt, dtype: float64

In [304]:
df.nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amt, dtype: float64

In [307]:
df = pd.DataFrame({'X': ['B', 'B', 'A', 'A'],
                   'Y': [1, 2, 3, 4]})
df

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [308]:
df.groupby("X")

In [310]:
df.groupby("X").sum()

   Y
X
A  7
B  3

In [311]:
df.groupby('X', sort = False).sum()

   Y
X
B  3
A  7

In [312]:
data = {'Name':['Elle', 'Chloe', 'Noah', 'Marco',  
                 'Lee', 'Elle', 'Rachel', 'Noah'],  
        'Age':[17, 19, 18, 17,  
               22, 18, 21, 20]}   
  
df = pd.DataFrame(data) 
df

     Name  Age
0    Elle   17
1   Chloe   19
2    Noah   18
3   Marco   17
4     Lee   22
5    Elle   18
6  Rachel   21
7    Noah   20

In [314]:
df.groupby("Name").sum()

        Age
Name
Chloe    19
Elle     35
Lee      22
Marco    17
Noah     38
Rachel   21

In [315]:
df = pd.DataFrame([('Bike', 'Kawasaki', 186),
                   ('Bike', 'Ducati Panigale', 202),
                   ('Car', 'Bugatti Chiron', 304), 
                   ('Car', 'Jaguar XJ220', 210),
                   ('Bike', 'Lightning LS-218', 218), 
                   ('Car', 'Hennessey Venom GT', 270),
                   ('Bike', 'BMW S1000RR', 188)], 
                  columns =('Type', 'Name', 'top_speed(mph)'))
  
df

   Type                Name  top_speed(mph)
0  Bike            Kawasaki             186
1  Bike     Ducati Panigale             202
2   Car      Bugatti Chiron             304
3   Car        Jaguar XJ220             210
4  Bike    Lightning LS-218             218
5   Car  Hennessey Venom GT             270
6  Bike         BMW S1000RR             188

In [317]:
df.groupby(["Type"])["top_speed(mph)"].nlargest()

Type
Bike  4    218
      1    202
      6    188
      0    186
Car   2    304
      5    270
      3    210
Name: top_speed(mph), dtype: int64

In [324]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [325]:
df1 = df.groupby(["customer_id","salesman_id"]).agg({"purch_amt":"sum"})
df1

                         purch_amt
customer_id salesman_id
3001        5001           2400.60
            5002            400.95
            5003            110.50
            5005            270.65
            5006           1983.43
3005        5001           8870.86
            5002            948.50
            5003           2480.40
            5007             75.29

In [326]:
df2 = df1["purch_amt"].groupby(["customer_id"],group_keys = False)
df2

In [327]:
df2.nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amt, dtype: float64

In [328]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [329]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3001         5002
1    70009     270.65  09-10-2012         3001         5005
2    70002      65.26  05-10-2013         3005         5001
3    70004     110.50  08-17-2013         3001         5003
4    70007     948.50  10-09-2013         3005         5002
5    70005    2400.60  07-27-2014         3001         5001
6    70008    5760.00  10-09-2012         3005         5001
7    70010    1983.43  10-10-2012         3001         5006
8    70003    2480.40  10-10-2012         3005         5003
9    70012     250.45  06-17-2014         3001         5002
10   70011      75.29  07-08-2012         3005         5007
11   70013    3045.60  04-25-2012         3005         5001

In [330]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       12 non-null     int64
 1   purch_amt    12 non-null     float64
 2   ord_date     12 non-null     object
 3   customer_id  12 non-null     int64
 4   salesman_id  12 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 608.0+ bytes

In [331]:
df["date"] = pd.to_datetime(df["ord_date"])
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id       date
0    70001     150.50  05-10-2012         3001         5002 2012-05-10
1    70009     270.65  09-10-2012         3001         5005 2012-09-10
2    70002      65.26  05-10-2013         3005         5001 2013-05-10
3    70004     110.50  08-17-2013         3001         5003 2013-08-17
4    70007     948.50  10-09-2013         3005         5002 2013-10-09
5    70005    2400.60  07-27-2014         3001         5001 2014-07-27
6    70008    5760.00  10-09-2012         3005         5001 2012-10-09
7    70010    1983.43  10-10-2012         3001         5006 2012-10-10
8    70003    2480.40  10-10-2012         3005         5003 2012-10-10
9    70012     250.45  06-17-2014         3001         5002 2014-06-17
10   70011      75.29  07-08-2012         3005         5007 2012-07-08
11   70013    3045.60  04-25-2012         3005         5001 2012-04-25

In [332]:
from datetime import datetime

In [337]:
df["year"] = df["date"].dt.year
df["month"] = df["date"].dt.month
df

,ord_no,purch_amt,ord_date,customer_id,salesman_id,date,year,month
0,70001,150.50,05-10-2012,3001,5002,2012-05-10,2012,5
1,70009,270.65,09-10-2012,3001,5005,2012-09-10,2012,9
2,70002,65.26,05-10-2013,3005,5001,2013-05-10,2013,5
3,70004,110.50,08-17-2013,3001,5003,2013-08-17,2013,8
4,70007,948.50,10-09-2013,3005,5002,2013-10-09,2013,10
5,70005,2400.60,07-27-2014,3001,5001,2014-07-27,2014,7
6,70008,5760.00,10-09-2012,3005,5001,2012-10-09,2012,10
7,70010,1983.43,10-10-2012,3001,5006,2012-10-10,2012,10
8,70003,2480.40,10-10-2012,3005,5003,2012-10-10,2012,10
9,70012,250.45,06-17-2014,3001,5002,2014-06-17,2014,6
10,70011,75.29,07-08-2012,3005,5007,2012-07-08,2012,7
11,70013,3045.60,04-25-2012,3005,5001,2012-04-25,2012,4

In [341]:
df_gr = df.groupby(["year","month"]).agg({"purch_amt":"sum"})

In [342]:
df_gr["purch_amt"].groupby("year",group_keys = False).nlargest()

year  month
2012  10       10223.83
      4         3045.60
      9          270.65
      5          150.50
      7           75.29
2013  10         948.50
      8          110.50
      5           65.26
2014  7         2400.60
      6          250.45
Name: purch_amt, dtype: float64

In [374]:
df_gr["purch_amt"].groupby("year",group_keys = False).nlargest().reset_index(name = "Purchase_Amount")

   year  month  Purchase_Amount
0  2012     10         10223.83
1  2012      4          3045.60
2  2012      9           270.65
3  2012      5           150.50
4  2012      7            75.29
5  2013     10           948.50
6  2013      8           110.50
7  2013      5            65.26
8  2014      7          2400.60
9  2014      6           250.45

### Write a Pandas program to split the following dataframe into groups based on all columns and calculate GroupBy value counts on the dataframe.

In [352]:
df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})
df

   id  type     book
0   1    10     Math
1   2    15  English
2   1    11  Physics
3   1    20     Math
4   2    21  English
5   1    12  Physics
6   2    14  English

In [358]:
df.groupby(["id","type","book"]).size()

id  type  book
1   10    Math       1
    11    Physics    1
    12    Physics    1
    20    Math       1
2   14    English    1
    15    English    1
    21    English    1
dtype: int64

In [356]:
df.groupby(["id","type","book"]).size().unstack()

book     English  Math  Physics
id type
1  10        NaN   1.0      NaN
   11        NaN   NaN      1.0
   12        NaN   NaN      1.0
   20        NaN   1.0      NaN
2  14        1.0   NaN      NaN
   15        1.0   NaN      NaN
   21        1.0   NaN      NaN

In [359]:
df.groupby(["id","type","book"]).size().unstack(fill_value=0)

book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0

### . Write a Pandas program to split a given dataframe into groups and list all the keys from the GroupBy object

In [360]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [362]:
gp = df.groupby(["school_code"])

In [363]:
gp.keys

['school_code']

In [364]:
gp.get_group("s001")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [366]:
gp.groups.keys()

dict_keys(['s001', 's002', 's003', 's004'])

### . Write a Pandas program to split a given dataframe into groups and create a new column with count from GroupBy

In [367]:
df = pd.DataFrame({
'book_name':['Book1','Book2','Book3','Book4','Book1','Book2','Book3','Book5'],
'book_type':['Math','Physics','Computer','Science','Math','Physics','Computer','English'],
'book_id':[1,2,3,4,1,2,3,5]})
df

  book_name book_type  book_id
0     Book1      Math        1
1     Book2   Physics        2
2     Book3  Computer        3
3     Book4   Science        4
4     Book1      Math        1
5     Book2   Physics        2
6     Book3  Computer        3
7     Book5   English        5

In [369]:
df.groupby(["book_name","book_type"])["book_type"].count()

book_name  book_type
Book1      Math         2
Book2      Physics      2
Book3      Computer     2
Book4      Science      1
Book5      English      1
Name: book_type, dtype: int64

In [370]:
df.groupby(["book_name"])["book_type"].count()

book_name
Book1    2
Book2    2
Book3    2
Book4    1
Book5    1
Name: book_type, dtype: int64

In [373]:
df.groupby(["book_name","book_type"])["book_type"].count().reset_index(name = "count")

  book_name book_type  count
0     Book1      Math      2
1     Book2   Physics      2
2     Book3  Computer      2
3     Book4   Science      1
4     Book5   English      1

### 20. Write a Pandas program to split a given dataframe into groups and display target column as a list of unique values.

In [375]:
df = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})

In [376]:
df

   id  type     book
0   A     1     Math
1   A     1     Math
2   A     1  English
3   A     1  Physics
4   A     2     Math
5   A     2  English
6   B     1  Physics
7   B     1  English
8   B     1  Physics
9   B     2  English
10  B     2  English

In [377]:
df.groupby(["id","book"])["book"].count()

id  book
A   English    2
    Math       3
    Physics    1
B   English    3
    Physics    2
Name: book, dtype: int64

In [378]:
df[["id","type","book"]]

   id  type     book
0   A     1     Math
1   A     1     Math
2   A     1  English
3   A     1  Physics
4   A     2     Math
5   A     2  English
6   B     1  Physics
7   B     1  English
8   B     1  Physics
9   B     2  English
10  B     2  English

In [379]:
df[["id","type","book"]].drop_duplicates()

  id  type     book
0  A     1     Math
2  A     1  English
3  A     1  Physics
4  A     2     Math
5  A     2  English
6  B     1  Physics
7  B     1  English
9  B     2  English

In [380]:
df.drop_duplicates()

  id  type     book
0  A     1     Math
2  A     1  English
3  A     1  Physics
4  A     2     Math
5  A     2  English
6  B     1  Physics
7  B     1  English
9  B     2  English

In [385]:
df1 = df[["id","type","book"]].drop_duplicates().groupby(["id","type"])["book"]
df1.head()
df1.apply(list)

id  type
A   1       [Math, English, Physics]
    2                [Math, English]
B   1             [Physics, English]
    2                      [English]
Name: book, dtype: object

In [382]:
df[["id","type","book"]].drop_duplicates().groupby(["id","type"])["book"].apply(list)

id  type
A   1       [Math, English, Physics]
    2                [Math, English]
B   1             [Physics, English]
    2                      [English]
Name: book, dtype: object

In [391]:
new_df = df[["id","type","book"]].drop_duplicates().groupby(["id","type"])["book"].apply(list).reset_index()
new_df

  id  type                      book
0  A     1  [Math, English, Physics]
1  A     2           [Math, English]
2  B     1        [Physics, English]
3  B     2                 [English]

In [395]:
new_df["book"] = new_df["book"].apply(lambda x : (",".join([str(i) for i in x])))
new_df

  id  type                  book
0  A     1  Math,English,Physics
1  A     2          Math,English
2  B     1       Physics,English
3  B     2               English

In [1]:
val = "español"
val

'español'

In [2]:
val_utf8 = val.encode('utf-8')
val_utf8
type(val_utf8)

bytes

In [3]:
val_utf8

b'espa\xc3\xb1ol'

In [4]:
val_utf8.decode('utf-8')

'español'

In [7]:
arr1 = np.array([1, 2, 3], dtype=np.float64)
arr1

array([1., 2., 3.])

In [8]:
numeric_strings = np.array(['1.25', '-9.6', '42'], dtype=np.string_)
numeric_strings

array([b'1.25', b'-9.6', b'42'], dtype='|S4')

In [9]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [10]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [11]:
first, second, third = pieces

In [12]:
first + '::' + second + '::' + third

'a::b::guido'

In [13]:
'::'.join(pieces)

'a::b::guido'

In [14]:
val.index(',')

1

In [15]:
val.find(':')

-1

In [16]:
val.replace(',', '::')

'a::b::  guido'

In [17]:
val.replace(',', '')

'ab  guido'

### numpy

### Write a NumPy program to create a 3x3x3 array with random values.

In [19]:
np.random.randn(3,3,3)

array([[[ 0.2974275 , -0.66213333,  0.47723862],
        [-0.38452115,  0.17974816,  0.48861382],
        [ 0.62541612, -0.03905857,  0.37217282]],

       [[ 0.05005762, -0.24891096,  2.05971672],
        [ 0.59057194,  0.83880714, -0.37887546],
        [ 1.38496947, -0.07199893, -0.26999057]],

       [[ 0.44317612, -0.53455505, -0.72321129],
        [-0.37458373, -0.68802131,  0.59835542],
        [ 2.38889745,  0.87425917,  0.38779606]]])

### 5. Write a NumPy program to create a random 10x4 array and extract the first five rows of the array and store them into a variable.

In [20]:
np.random.randn(10,4)

array([[-1.51125897,  0.0901655 ,  0.1386262 , -1.21420706],
       [ 0.55329334,  0.03337478,  1.86776154, -1.09871841],
       [ 0.49258134, -2.14400122,  0.4012693 ,  0.5328948 ],
       [ 1.36551355,  1.19469504,  2.55245029,  1.50977475],
       [-0.02066706, -0.22591919, -0.16058168,  0.04847064],
       [-1.13128908,  0.06368804,  0.5055667 , -0.6144473 ],
       [ 1.21887736,  1.42491028,  0.15973167,  0.44391525],
       [-0.07176142, -0.9129968 , -1.63990355,  0.76880281],
       [-0.49395698,  0.69433519,  0.40789701, -0.58237415],
       [ 0.59331688,  1.58543933, -1.42314646, -0.68640602]])

In [23]:
a = np.random.randn(10,4)[:5]
a

array([[-1.53056321, -0.26343344, -0.36435569,  1.82542414],
       [-1.65321235,  0.23710488, -0.11274987,  1.19796494],
       [-1.66736143,  0.41546762,  1.73452449, -1.45266627],
       [-0.21538407, -1.15144301,  0.35573094, -2.7975978 ],
       [-0.23355349,  0.05980662,  0.99400651,  1.27546587]])

### 10. Write a NumPy program to check two random arrays are equal or not. Go to the editor

In [35]:
a = np.random.randint(0,100,20)

In [36]:
a

array([30, 19,  3, 83, 50, 33, 85, 43, 81, 84, 99, 70, 96, 17, 42, 98, 72,
       34, 61, 34])

In [28]:
 np.random.randint(0,100,(20,5))

array([[81, 84, 41, 50, 56],
       [63, 87, 94, 77, 17],
       [58,  6, 86, 57, 45],
       [36, 64, 65, 48, 65],
       [22, 42,  2, 94, 96],
       [73,  1, 51, 56, 13],
       [ 0, 19, 99, 57, 85],
       [78, 99, 38, 26, 69],
       [79,  4,  7, 10, 37],
       [68, 90, 51, 81, 91],
       [46,  0, 74,  9, 91],
       [83, 34,  1, 96, 14],
       [29, 24, 94, 15, 23],
       [72, 96, 34, 31, 55],
       [70, 94, 86,  2, 63],
       [10, 26, 63, 83, 83],
       [30, 62, 87, 26, 98],
       [44, 45, 39, 97, 86],
       [22, 92,  7, 99, 99],
       [84, 77,  0, 46, 28]])

In [37]:
b = np.random.randint(0,100,20)

In [38]:
b

array([ 7, 80, 14, 93, 62, 45, 70, 76, 86, 30, 75, 54, 77, 27, 61, 44, 46,
       67, 99, 74])

In [40]:
a == b

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False])

In [43]:
np.allclose(a,b) ## checking equality of two arrays

False

### 4. Write a NumPy program to sort the student id with increasing height of the students from given students id and height. Print the integer indices that describes the sort order by multiple columns and the sorted data

In [42]:
student_id = np.array([1023, 5202, 6230, 1671, 1682, 5241, 4532])
student_height = np.array([40., 42., 45., 41., 38., 40., 42.0])

### np.lexsort((b, a))
(i) Perform an indirect sort using a sequence of keys
(ii) Sort by a, then by b

In [49]:
arr = np.lexsort((student_id,student_height))
arr

array([4, 0, 5, 3, 6, 1, 2], dtype=int64)

In [50]:
for i in arr:
    print(student_id[i],student_height[i])

1682 38.0
1023 40.0
5241 40.0
1671 41.0
4532 42.0
5202 42.0
6230 45.0

### argsort()

In [51]:
arr1 = np.argsort(student_height)
arr1

array([4, 0, 5, 3, 1, 6, 2], dtype=int64)

In [52]:
for i in arr1:
    print(student_id[i],student_height[i])

1682 38.0
1023 40.0
5241 40.0
1671 41.0
5202 42.0
4532 42.0
6230 45.0

### 11. Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount

In [64]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [65]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3001         5002
1    70009     270.65  09-10-2012         3001         5005
2    70002      65.26  05-10-2013         3005         5001
3    70004     110.50  08-17-2013         3001         5003
4    70007     948.50  10-09-2013         3005         5002
5    70005    2400.60  07-27-2014         3001         5001
6    70008    5760.00  10-09-2012         3005         5001
7    70010    1983.43  10-10-2012         3001         5006
8    70003    2480.40  10-10-2012         3005         5003
9    70012     250.45  06-17-2014         3001         5002
10   70011      75.29  07-08-2012         3005         5007
11   70013    3045.60  04-25-2012         3005         5001

In [66]:
df["date"] = pd.to_datetime(df["ord_date"])
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id       date
0    70001     150.50  05-10-2012         3001         5002 2012-05-10
1    70009     270.65  09-10-2012         3001         5005 2012-09-10
2    70002      65.26  05-10-2013         3005         5001 2013-05-10
3    70004     110.50  08-17-2013         3001         5003 2013-08-17
4    70007     948.50  10-09-2013         3005         5002 2013-10-09
5    70005    2400.60  07-27-2014         3001         5001 2014-07-27
6    70008    5760.00  10-09-2012         3005         5001 2012-10-09
7    70010    1983.43  10-10-2012         3001         5006 2012-10-10
8    70003    2480.40  10-10-2012         3005         5003 2012-10-10
9    70012     250.45  06-17-2014         3001         5002 2014-06-17
10   70011      75.29  07-08-2012         3005         5007 2012-07-08
11   70013    3045.60  04-25-2012         3005         5001 2012-04-25

In [67]:
df["month"] = df["date"].dt.month

In [68]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id       date  month
0    70001     150.50  05-10-2012         3001         5002 2012-05-10      5
1    70009     270.65  09-10-2012         3001         5005 2012-09-10      9
2    70002      65.26  05-10-2013         3005         5001 2013-05-10      5
3    70004     110.50  08-17-2013         3001         5003 2013-08-17      8
4    70007     948.50  10-09-2013         3005         5002 2013-10-09     10
5    70005    2400.60  07-27-2014         3001         5001 2014-07-27      7
6    70008    5760.00  10-09-2012         3005         5001 2012-10-09     10
7    70010    1983.43  10-10-2012         3001         5006 2012-10-10     10
8    70003    2480.40  10-10-2012         3005         5003 2012-10-10     10
9    70012     250.45  06-17-2014         3001         5002 2014-06-17      6
10   70011      75.29  07-08-2012         3005         5007 2012-07-08      7
11   70013    3045.60  04-25-2012         3005         5001 2012-04-25      4

In [69]:
df.groupby(["month"])["purch_amt"].sum()

month
4      3045.60
5       215.76
6       250.45
7      2475.89
8       110.50
9       270.65
10    11172.33
Name: purch_amt, dtype: float64

In [70]:
df["year"] = df["date"].dt.year

In [71]:
df

,ord_no,purch_amt,ord_date,customer_id,salesman_id,date,month,year
0,70001,150.50,05-10-2012,3001,5002,2012-05-10,5,2012
1,70009,270.65,09-10-2012,3001,5005,2012-09-10,9,2012
2,70002,65.26,05-10-2013,3005,5001,2013-05-10,5,2013
3,70004,110.50,08-17-2013,3001,5003,2013-08-17,8,2013
4,70007,948.50,10-09-2013,3005,5002,2013-10-09,10,2013
5,70005,2400.60,07-27-2014,3001,5001,2014-07-27,7,2014
6,70008,5760.00,10-09-2012,3005,5001,2012-10-09,10,2012
7,70010,1983.43,10-10-2012,3001,5006,2012-10-10,10,2012
8,70003,2480.40,10-10-2012,3005,5003,2012-10-10,10,2012
9,70012,250.45,06-17-2014,3001,5002,2014-06-17,6,2014
10,70011,75.29,07-08-2012,3005,5007,2012-07-08,7,2012
11,70013,3045.60,04-25-2012,3005,5001,2012-04-25,4,2012

In [72]:
df.groupby(["year","month"])["purch_amt"].sum()

year  month
2012  4         3045.60
      5          150.50
      7           75.29
      9          270.65
      10       10223.83
2013  5           65.26
      8          110.50
      10         948.50
2014  6          250.45
      7         2400.60
Name: purch_amt, dtype: float64

### 15. Write a Pandas program to split the following dataframe into groups and count unique values of 'value' column.

In [73]:
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})

In [74]:
df

   id value
0   1     a
1   1     a
2   2     b
3   3  None
4   3     a
5   4     a
6   4  None
7   4     b

In [76]:
df.groupby(["id"])["value"].nunique()

id
1    1
2    1
3    1
4    2
Name: value, dtype: int64

In [77]:
df["value"].nunique()

2

### 19. Write a Pandas program to split a given dataframe into groups with multiple aggregations. Go to the editor
Split the following given dataframe by school code, class and get mean, min, and max value of height and age for each value of the school.

In [79]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s001'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [80]:
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s001,VI,David Parkes,15/09/1997,12,159,32,street4

In [81]:
df.groupby(["school_code","class"])["age","height"].agg(["mean","max","min"])

<ipython-input-81-82ef5ab0bc46>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(["school_code","class"])["age","height"].agg(["mean","max","min"])

                    age         height
                   mean max min   mean  max  min
school_code class
s001        V      12.0  12  12  173.0  173  173
            VI     12.5  13  12  163.0  167  159
s002        V      13.0  14  12  171.5  192  151
s003        VI     13.0  13  13  186.0  186  186

In [82]:
df.groupby(["school_code","class"]).agg({"height":["mean","max","min"],"age":["mean","max","min"]})

                  height             age
                    mean  max  min  mean max min
school_code class
s001        V      173.0  173  173  12.0  12  12
            VI     163.0  167  159  12.5  13  12
s002        V      171.5  192  151  13.0  14  12
s003        VI     186.0  186  186  13.0  13  13

### Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.

In [86]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [88]:
student_data.groupby(["school_code"]).agg(Age_mean=("age","mean"),Age_max=("age","max"),Age_min=("age","min"))

             Age_mean  Age_max  Age_min
school_code
s001             12.5       13       12
s002             13.0       14       12
s003             13.0       13       13
s004             12.0       12       12

### 1. Write a Pandas program to display the default index and set a column as an Index in a given dataframe

In [89]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [90]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [92]:
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [93]:
df.set_index("school_code")

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

### 2. Write a Pandas program to create a multi Index frame using two columns and using an Index and a column. Go to the editor

In [100]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [101]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [103]:
df1 = df.set_index(["school_code","t_id"])

In [104]:
df1

                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4

In [99]:
df.reset_index(["school_code"],inplace=True)

KeyError: 'Requested level (school_code) does not match index name (None)'

In [107]:
df1.reset_index(inplace=True)

In [108]:
df1

  school_code t_id class            name date_Of_Birth  weight  address
0        s001   t1     V  Alberto Franco    15/05/2002      35  street1
1        s002   t2     V    Gino Mcneill    17/05/2002      32  street2
2        s003   t3    VI     Ryan Parkes    16/02/1999      33  street3
3        s001   t4    VI    Eesha Hinton    25/09/1998      30  street1
4        s002   t5     V    Gino Mcneill    11/05/2002      31  street2
5        s004   t6    VI    David Parkes    15/09/1997      32  street4

In [109]:
df

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [110]:
df.reset_index()

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [112]:
df.reset_index(inplace = True)

In [113]:
df

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [114]:
df.reset_index(inplace=True)

In [115]:
df

,level_0,index,school_code,class,name,date_Of_Birth,weight,address,t_id
0,0,0,s001,V,Alberto Franco,15/05/2002,35,street1,t1
1,1,1,s002,V,Gino Mcneill,17/05/2002,32,street2,t2
2,2,2,s003,VI,Ryan Parkes,16/02/1999,33,street3,t3
3,3,3,s001,VI,Eesha Hinton,25/09/1998,30,street1,t4
4,4,4,s002,V,Gino Mcneill,11/05/2002,31,street2,t5
5,5,5,s004,VI,David Parkes,15/09/1997,32,street4,t6

### Write a Pandas program to create an index labels by using 64-bit integers, using floating-point numbers in a given dataframe.

In [116]:
df_i64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[1, 2, 3, 4, 5, 6])

In [117]:
df_i64

  school_code class            name date_Of_Birth  weight  address
1        s001     V  Alberto Franco    15/05/2002      35  street1
2        s002     V    Gino Mcneill    17/05/2002      32  street2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1
5        s002     V    Gino Mcneill    11/05/2002      31  street2
6        s004    VI    David Parkes    15/09/1997      32  street4

In [118]:
df_i64.index

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [119]:
df_i64.index.name = "Rank"

In [120]:
df_i64

     school_code class            name date_Of_Birth  weight  address
Rank
1           s001     V  Alberto Franco    15/05/2002      35  street1
2           s002     V    Gino Mcneill    17/05/2002      32  street2
3           s003    VI     Ryan Parkes    16/02/1999      33  street3
4           s001    VI    Eesha Hinton    25/09/1998      30  street1
5           s002     V    Gino Mcneill    11/05/2002      31  street2
6           s004    VI    David Parkes    15/09/1997      32  street4

### 6. Write a Pandas program to create a dataframe indexing by date and time

### 11. Write a Pandas program to check if a specified value exists in single and multiple column index dataframe.

In [122]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

In [123]:
df

  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

In [124]:
df1 = df.set_index(["school_code","class","t_id"])

In [125]:
df1

                                  name date_of_birth  weight
school_code class t_id
s001        V     t1    Alberto Franco    15/05/2002      35
s002        V     t2      Gino Mcneill    17/05/2002      32
s003        VI    t3       Ryan Parkes    16/02/1999      33
s001        VI    t4      Eesha Hinton    25/09/1998      30
s002        V     t5      Gino Mcneill    11/05/2002      31
s004        VI    t6      David Parkes    15/09/1997      32

In [126]:
df1.reset_index(["school_code","t_id"],inplace = True)

In [127]:
df1

      school_code t_id            name date_of_birth  weight
class
V            s001   t1  Alberto Franco    15/05/2002      35
V            s002   t2    Gino Mcneill    17/05/2002      32
VI           s003   t3     Ryan Parkes    16/02/1999      33
VI           s001   t4    Eesha Hinton    25/09/1998      30
V            s002   t5    Gino Mcneill    11/05/2002      31
VI           s004   t6    David Parkes    15/09/1997      32

In [169]:
df1.loc["V"]

      school_code t_id            name date_of_birth  weight
class
V            s001   t1  Alberto Franco    15/05/2002      35
V            s002   t2    Gino Mcneill    17/05/2002      32
V            s002   t5    Gino Mcneill    11/05/2002      31

In [170]:
df1.iloc[2,4]

33

In [171]:
df1["V"]

KeyError: 'V'

### Join and merging

### Write a Pandas program to join the two given dataframes along rows and assign all data.

In [129]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [131]:
pd.concat([student_data1,student_data2])

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [134]:
pd.merge(student_data1,student_data2)

Empty DataFrame
Columns: [student_id, name, marks]
Index: []

In [133]:
pd.merge(student_data1,student_data2,how = "left")

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [135]:
pd.merge(student_data1,student_data2,how = "right")

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [139]:
pd.merge(student_data1,student_data2,on = "student_id", how = "left")

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton      200               NaN      NaN
1         S2      Ryder Storey      210               NaN      NaN
2         S3      Bryce Jensen      190               NaN      NaN
3         S4         Ed Bernal      222  Scarlette Fisher    201.0
4         S5       Kwame Morin      199  Carla Williamson    200.0

In [140]:
pd.merge(student_data1,student_data2,on = "student_id", how = "right")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal    222.0  Scarlette Fisher      201
1         S5  Kwame Morin    199.0  Carla Williamson      200
2         S6          NaN      NaN       Dante Morse      198
3         S7          NaN      NaN    Kaiser William      219
4         S8          NaN      NaN   Madeeha Preston      201

In [136]:
pd.merge(student_data1,student_data2,on = "student_id")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

In [137]:
pd.merge(student_data1,student_data2,on = "student_id",suffixes = ["1","2"])

  student_id        name1  marks1             name2  marks2
0         S4    Ed Bernal     222  Scarlette Fisher     201
1         S5  Kwame Morin     199  Carla Williamson     200

In [138]:
pd.merge(student_data1,student_data2,on = "marks")

  student_id_x            name_x  marks student_id_y            name_y
0           S1  Danniella Fenton    200           S5  Carla Williamson

### vstack and hstack

In [142]:
arr = np.array([1,2,3])
arr1 = np.array([4,5,6])
np.vstack((arr,arr1))

array([[1, 2, 3],
       [4, 5, 6]])

In [143]:
arr = np.array([[1],[2],[3]])
arr1 = np.array([[4],[5],[6]])
np.vstack((arr,arr1))

array([[1],
       [2],
       [3],
       [4],
       [5],
       [6]])

In [145]:
arr = np.array([1,2,3])
arr1 = np.array([4,5,6])
np.hstack((arr,arr1))

array([1, 2, 3, 4, 5, 6])

In [146]:
arr = np.array([[1],[2],[3]])
arr1 = np.array([[4],[5],[6]])
np.hstack((arr,arr1))

array([[1, 4],
       [2, 5],
       [3, 6]])

In [148]:
arr = np.array([1,2,3])
arr1 = np.array([4,5,6])
np.column_stack((arr,arr1))

array([[1, 4],
       [2, 5],
       [3, 6]])

In [149]:
arr = np.array([[1],[2],[3]])
arr1 = np.array([[4],[5],[6]])
np.column_stack((arr,arr1))

array([[1, 4],
       [2, 5],
       [3, 6]])

In [153]:
arr = np.array([[1,2,3],[4,5,6]])
np.ndim(arr)

2

In [154]:
np.size(arr)

6

In [155]:
np.shape(arr)

(2, 3)

In [158]:
arr = np.arange(12).reshape(3,4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [159]:
np.where(arr<6,1,arr*2)

array([[ 1,  1,  1,  1],
       [ 1,  1, 12, 14],
       [16, 18, 20, 22]])

In [160]:
np.where(arr/2 == 0,arr**2,arr*0.5)

array([[0. , 0.5, 1. , 1.5],
       [2. , 2.5, 3. , 3.5],
       [4. , 4.5, 5. , 5.5]])

In [161]:
np.random.normal(1000,loc=50,scale = 0.5)

TypeError: normal() got multiple values for keyword argument 'loc'

In [163]:
np.random.normal(size = 10,loc=50,scale = 0.5)

array([49.6440731 , 49.43253124, 50.31702891, 49.37456161, 50.47393862,
       49.42329707, 49.14417582, 50.10550474, 49.72456334, 50.21070735])

In [164]:
np.random.normal(size = 10,loc=50,scale = 25)

array([ 44.21127108,  80.86003249,  10.63397161,  68.48353683,
        41.59264198, 100.90009143,  36.17635224,  56.03999504,
        76.48276009,  79.19913569])

In [167]:
arr = np.random.randn(4)
arr

array([ 0.83701874, -0.75110761,  0.16075302, -0.03430042])

In [166]:
np.ndim(arr)

1

In [178]:
s = pd.Series([np.random.randn(5)])

In [179]:
s

0    [-1.5804273069687658, -0.5915051496676054, -0....
dtype: object

In [177]:
np.random.randn(5)

array([-1.0498179 ,  0.53456685, -0.23176689,  2.05016526,  0.81131683])

In [182]:
s1 = pd.Series(np.random.randn(5),index=[1,2,3,4,5])
s1

1    0.057646
2    0.885688
3    0.195634
4    1.164065
5   -0.277723
dtype: float64

In [184]:
s1 = pd.Series(np.random.randn(5),index=np.arange(1,6))
s1

1    0.416917
2    1.660114
3    0.330892
4   -0.369307
5   -1.315714
dtype: float64

In [185]:
dict1 = {
    "s1":{"name":"Preetam","Roll":18},
    "s2":{"name":"Rachel","Roll":25}
}

In [186]:
df = pd.DataFrame(dict1)

In [187]:
df

           s1      s2
name  Preetam  Rachel
Roll       18      25

In [191]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [192]:
data = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data, orient='index')

       0  1  2  3
row_1  3  2  1  0
row_2  a  b  c  d

In [193]:
pd.DataFrame.from_dict(data, orient='index',
                      columns=['A', 'B', 'C', 'D'])

       A  B  C  D
row_1  3  2  1  0
row_2  a  b  c  d

In [194]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [195]:
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [199]:
student_data.groupby(["school_code"]).agg(age_mean=("age","mean"),age_min=("age","min"),age_max=("age","max"))

             age_mean  age_min  age_max
school_code
s001             12.5       12       13
s002             13.0       12       14
s003             13.0       13       13
s004             12.0       12       12

In [201]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [202]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001

In [224]:
df1 = df.groupby(["customer_id","salesman_id"]).agg(purch_amnt = ("purch_amt","sum"))
df1

                         purch_amnt
customer_id salesman_id
3001        5001            2400.60
            5002             400.95
            5003             110.50
            5005             270.65
            5006            1983.43
3005        5001            8870.86
            5002             948.50
            5003            2480.40
            5007              75.29

In [225]:
df1.nlargest()

TypeError: nlargest() missing 2 required positional arguments: 'n' and 'columns'

In [214]:
df1["purch_amnt"]

customer_id  salesman_id
3001         5001           2400.60
             5002            400.95
             5003            110.50
             5005            270.65
             5006           1983.43
3005         5001           8870.86
             5002            948.50
             5003           2480.40
             5007             75.29
Name: purch_amnt, dtype: float64

In [213]:
df1["purch_amnt"].nlargest()

customer_id  salesman_id
3005         5001           8870.86
             5003           2480.40
3001         5001           2400.60
             5006           1983.43
3005         5002            948.50
Name: purch_amnt, dtype: float64

In [211]:
df1.groupby("customer_id")["purch_amnt"].nlargest()

customer_id  customer_id  salesman_id
3001         3001         5001           2400.60
                          5006           1983.43
                          5002            400.95
                          5005            270.65
                          5003            110.50
3005         3005         5001           8870.86
                          5003           2480.40
                          5002            948.50
                          5007             75.29
Name: purch_amnt, dtype: float64

In [236]:
df1.groupby("customer_id",group_keys=False)["purch_amnt"].nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amnt, dtype: float64

In [237]:
df1.groupby(level = 0,group_keys=False)["purch_amnt"].nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amnt, dtype: float64

In [238]:
df1.groupby("salesman_id")["purch_amnt"].nlargest()

salesman_id  customer_id  salesman_id
5001         3005         5001           8870.86
             3001         5001           2400.60
5002         3005         5002            948.50
             3001         5002            400.95
5003         3005         5003           2480.40
             3001         5003            110.50
5005         3001         5005            270.65
5006         3001         5006           1983.43
5007         3005         5007             75.29
Name: purch_amnt, dtype: float64

In [239]:
df1.groupby(level =1)["purch_amnt"].nlargest()

salesman_id  customer_id  salesman_id
5001         3005         5001           8870.86
             3001         5001           2400.60
5002         3005         5002            948.50
             3001         5002            400.95
5003         3005         5003           2480.40
             3001         5003            110.50
5005         3001         5005            270.65
5006         3001         5006           1983.43
5007         3005         5007             75.29
Name: purch_amnt, dtype: float64

In [229]:
df1.groupby(level = 0)["purch_amnt"].nlargest()

customer_id  customer_id  salesman_id
3001         3001         5001           2400.60
                          5006           1983.43
                          5002            400.95
                          5005            270.65
                          5003            110.50
3005         3005         5001           8870.86
                          5003           2480.40
                          5002            948.50
                          5007             75.29
Name: purch_amnt, dtype: float64

In [230]:
df2 = df1["purch_amnt"].groupby(level=0)

In [231]:
df2

In [232]:
df2.nlargest()

customer_id  customer_id  salesman_id
3001         3001         5001           2400.60
                          5006           1983.43
                          5002            400.95
                          5005            270.65
                          5003            110.50
3005         3005         5001           8870.86
                          5003           2480.40
                          5002            948.50
                          5007             75.29
Name: purch_amnt, dtype: float64

In [233]:
df2 = df1["purch_amnt"].groupby(level=0,group_keys = False)

In [235]:
df2.nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amnt, dtype: float64

In [240]:
s1 = pd.Series(data = [2,3,4],index = [1,2,3,4])
s1

ValueError: Length of passed values is 3, index implies 4.

In [241]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [242]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001

In [243]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [244]:
df.axes

[RangeIndex(start=0, stop=12, step=1),
 Index(['ord_no', 'purch_amt', 'ord_date', 'customer_id', 'salesman_id'], dtype='object')]

In [245]:
df.transpose

<bound method DataFrame.transpose of     ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001>

In [246]:
df.T

,0,1,2,3,4,5,6,7,8,9,10,11
ord_no,70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013
purch_amt,150.5,270.65,65.26,110.5,948.5,2400.6,5760.0,1983.43,2480.4,250.45,75.29,3045.6
ord_date,2012-10-05,2012-09-10,2012-10-05,2012-08-17,2012-09-10,2012-07-27,2012-09-10,2012-10-10,2012-10-10,2012-06-27,2012-08-17,2012-04-25
customer_id,3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005
salesman_id,5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001

In [247]:
df.axes

[RangeIndex(start=0, stop=12, step=1),
 Index(['ord_no', 'purch_amt', 'ord_date', 'customer_id', 'salesman_id'], dtype='object')]

In [249]:
df.size

60

In [250]:
df.empty

False

In [251]:
s1 = pd.Series()

<ipython-input-251-476a4a152c5f>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1 = pd.Series()

In [252]:
s1 = pd.Series(None)

<ipython-input-252-828261416cff>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1 = pd.Series(None)

In [253]:
arr = np.arange(5).reshape(1,5)

In [254]:
arr

array([[0, 1, 2, 3, 4]])

In [255]:
arr.size

5

In [257]:
np.resize(arr,(2,5))

array([[0, 1, 2, 3, 4],
       [0, 1, 2, 3, 4]])

In [258]:
np.resize(arr,(1,4))

array([[0, 1, 2, 3]])

In [259]:
np.resize(arr,(2,6))

array([[0, 1, 2, 3, 4, 0],
       [1, 2, 3, 4, 0, 1]])

In [260]:
arr.types

AttributeError: 'numpy.ndarray' object has no attribute 'types'

In [261]:
arr = np.arange(8).reshape(4,2)
arr

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [262]:
arr.min()

0

In [263]:
np.full((2,3),87)

array([[87, 87, 87],
       [87, 87, 87]])

In [264]:
arr1 = np.array([1,2,3])
arr2 = np.array([-2,5,0])
np.fmin(arr1,arr2)

array([-2,  2,  0])

In [265]:
dt = np.dtype('>i4')
dt.byteorder

'>'

In [266]:
dt.itemsize

4

In [267]:
dt.name

'int32'

In [268]:
dt.type is np.int32

True

### 15. Write a Pandas program to Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame. Go to the editor

In [3]:
df1 = pd.DataFrame({'A': [None, 0, None], 'B': [3, 4, 5]})
df2 = pd.DataFrame({'A': [1, 1, 3], 'B': [3, None, 3]})

In [4]:
df1

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

In [5]:
df2

   A    B
0  1  3.0
1  1  NaN
2  3  3.0

In [7]:
pd.merge(df1,df2,on = "A")

Empty DataFrame
Columns: [A, B_x, B_y]
Index: []

In [8]:
pd.merge(df1,df2,on=["A","B"])

Empty DataFrame
Columns: [A, B]
Index: []

In [9]:
pd.merge(df2,df1)

Empty DataFrame
Columns: [A, B]
Index: []

In [10]:
pd.merge(df2,df1,on = "B")

   A_x    B  A_y
0    1  3.0  NaN
1    3  3.0  NaN

In [11]:
df1.combine_first(df2)

     A    B
0  1.0  3.0
1  0.0  4.0
2  3.0  5.0

In [12]:
df2.combine_first(df1)

     A    B
0  1.0  3.0
1  1.0  4.0
2  3.0  3.0

### Write a Pandas program to join the two dataframes with matching records from both sides where available.

In [13]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [14]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [15]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [18]:
pd.merge(student_data1,student_data2,on = "student_id")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

In [19]:
pd.merge(student_data1,student_data2,on = "student_id",how = "left")

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton      200               NaN      NaN
1         S2      Ryder Storey      210               NaN      NaN
2         S3      Bryce Jensen      190               NaN      NaN
3         S4         Ed Bernal      222  Scarlette Fisher    201.0
4         S5       Kwame Morin      199  Carla Williamson    200.0

In [21]:
pd.merge(student_data1,student_data2,on = "student_id",how = "left",suffixes=["_1","_2"])

  student_id            name_1  marks_1            name_2  marks_2
0         S1  Danniella Fenton      200               NaN      NaN
1         S2      Ryder Storey      210               NaN      NaN
2         S3      Bryce Jensen      190               NaN      NaN
3         S4         Ed Bernal      222  Scarlette Fisher    201.0
4         S5       Kwame Morin      199  Carla Williamson    200.0

### 5. Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id

In [23]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})


exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

In [24]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [25]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [26]:
exam_data

   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

In [29]:
df1 = pd.concat((student_data1,student_data2),ignore_index=True)

In [30]:
df1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

In [31]:
pd.merge(df1,exam_data,on = "student_id")

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

In [32]:
pd.merge(df1,exam_data,on = "student_id",how = "right")

   student_id              name  marks  exam_id
0          S1  Danniella Fenton  200.0       23
1          S2      Ryder Storey  210.0       45
2          S3      Bryce Jensen  190.0       12
3          S4         Ed Bernal  222.0       67
4          S4  Scarlette Fisher  201.0       67
5          S5       Kwame Morin  199.0       21
6          S5  Carla Williamson  200.0       21
7          S7    Kaiser William  219.0       55
8          S8   Madeeha Preston  201.0       33
9          S9               NaN    NaN       14
10        S10               NaN    NaN       56
11        S11               NaN    NaN       83
12        S12               NaN    NaN       88
13        S13               NaN    NaN       12

In [35]:
s1 = pd.merge(df1,exam_data,on = "student_id",how = "left")

In [36]:
s1.index.name = "Student"

In [37]:
s1

        student_id              name  marks  exam_id
Student
0               S1  Danniella Fenton    200     23.0
1               S2      Ryder Storey    210     45.0
2               S3      Bryce Jensen    190     12.0
3               S4         Ed Bernal    222     67.0
4               S5       Kwame Morin    199     21.0
5               S4  Scarlette Fisher    201     67.0
6               S5  Carla Williamson    200     21.0
7               S6       Dante Morse    198      NaN
8               S7    Kaiser William    219     55.0
9               S8   Madeeha Preston    201     33.0

In [38]:
s1.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64', name='Student')

In [39]:
s1.columns

Index(['student_id', 'name', 'marks', 'exam_id'], dtype='object')

In [41]:
s1.set_index(["a","b","c","d","e","f","g","h","i","j"],inplace=True)

KeyError: "None of ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] are in the columns"

In [42]:
s1.set_index(np.arange(3,13),inplace=True)

In [43]:
s1

   student_id              name  marks  exam_id
3          S1  Danniella Fenton    200     23.0
4          S2      Ryder Storey    210     45.0
5          S3      Bryce Jensen    190     12.0
6          S4         Ed Bernal    222     67.0
7          S5       Kwame Morin    199     21.0
8          S4  Scarlette Fisher    201     67.0
9          S5  Carla Williamson    200     21.0
10         S6       Dante Morse    198      NaN
11         S7    Kaiser William    219     55.0
12         S8   Madeeha Preston    201     33.0

In [45]:
s1.set_index(np.array(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']),inplace=True)

In [46]:
s1

  student_id              name  marks  exam_id
a         S1  Danniella Fenton    200     23.0
b         S2      Ryder Storey    210     45.0
c         S3      Bryce Jensen    190     12.0
d         S4         Ed Bernal    222     67.0
e         S5       Kwame Morin    199     21.0
f         S4  Scarlette Fisher    201     67.0
g         S5  Carla Williamson    200     21.0
h         S6       Dante Morse    198      NaN
i         S7    Kaiser William    219     55.0
j         S8   Madeeha Preston    201     33.0

In [47]:
s1.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [48]:
s1.columns

Index(['student_id', 'name', 'marks', 'exam_id'], dtype='object')

In [50]:
s1.dtypes

student_id     object
name           object
marks           int64
exam_id       float64
dtype: object

In [51]:
s1.index.dtype

dtype('O')

In [52]:
s1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  10 non-null     object
 1   name        10 non-null     object
 2   marks       10 non-null     int64
 3   exam_id     9 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

### 31. Write a Pandas program to split the following dataset using group by on 'salesman_id' and find the first order date for each group

In [56]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5004,5003,5002,5004,5001]})

In [57]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5004
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5004
11   70013    3045.60  2012-04-25         3002         5001

In [58]:
df.groupby(["salesman_id"])["ord_date"].min()

salesman_id
5001    2012-04-25
5002    2012-06-27
5003    2012-08-17
5004    2012-08-17
5005    2012-09-10
Name: ord_date, dtype: object

In [59]:
df.groupby(["salesman_id"]).agg({"ord_date":min})

               ord_date
salesman_id
5001         2012-04-25
5002         2012-06-27
5003         2012-08-17
5004         2012-08-17
5005         2012-09-10

In [60]:
df.groupby(["salesman_id"]).agg({"ord_date":max})

               ord_date
salesman_id
5001         2012-10-05
5002         2012-10-05
5003         2012-10-10
5004         2012-10-10
5005         2012-09-10

### Write a Pandas program to split a given dataset using group by on multiple columns and drop last n rows of from each group.

In [69]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3002,3001,3004,3003,3002,3003,3001],
'salesman_id':[5002,5003,5001,5003,5002,5001,5001,5003,5003,5002,5003,5001]})

In [70]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3002         5002
1    70009     270.65  2012-09-10         3001         5003
2    70002      65.26  2012-10-05         3001         5001
3    70004     110.50  2012-08-17         3003         5003
4    70007     948.50  2012-09-10         3002         5002
5    70005    2400.60  2012-07-27         3002         5001
6    70008    5760.00  2012-09-10         3001         5001
7    70010    1983.43  2012-10-10         3004         5003
8    70003    2480.40  2012-10-10         3003         5003
9    70012     250.45  2012-06-27         3002         5002
10   70011      75.29  2012-08-17         3003         5003
11   70013    3045.60  2012-04-25         3001         5001

In [71]:
df1 = df.groupby(["salesman_id","customer_id"])

In [72]:
for name,content in df1:
    print(name)
    print(content)

(5001, 3001)
    ord_no  purch_amt    ord_date  customer_id  salesman_id
2    70002      65.26  2012-10-05         3001         5001
6    70008    5760.00  2012-09-10         3001         5001
11   70013    3045.60  2012-04-25         3001         5001
(5001, 3002)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
5   70005     2400.6  2012-07-27         3002         5001
(5002, 3002)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
4   70007     948.50  2012-09-10         3002         5002
9   70012     250.45  2012-06-27         3002         5002
(5003, 3001)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
1   70009     270.65  2012-09-10         3001         5003
(5003, 3003)
    ord_no  purch_amt    ord_date  customer_id  salesman_id
3    70004     110.50  2012-08-17         3003         5003
8    70003    2480.40  2012-10-10         3003         5003
10   70011      75.29  2012-08-17         3003         5003
(5003, 3004)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
7   70010    1983.43  2012-10-10         3004         5003

In [76]:
df.drop(df1.tail(2),axis = 0)

KeyError: "['ord_no' 'purch_amt' 'ord_date' 'customer_id' 'salesman_id'] not found in axis"

In [74]:
df1.tail(2).index

Int64Index([1, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [77]:
df.drop(df1.tail(2).index,axis = 0 )

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
2   70002      65.26  2012-10-05         3001         5001
3   70004     110.50  2012-08-17         3003         5003

In [80]:
s = pd.Series(np.arange(10),index = [["a","a","b","b","c","c","d","d","e","e"],[1,2,1,2,1,2,1,2,1,2]])
s

a  1    0
   2    1
b  1    2
   2    3
c  1    4
   2    5
d  1    6
   2    7
e  1    8
   2    9
dtype: int32

In [82]:
s.unstack()

   1  2
a  0  1
b  2  3
c  4  5
d  6  7
e  8  9

In [85]:
s1 = pd.Series(np.arange(10),index = [["a","a","b","b","c","c","d","d","e","e"],[1,2,1,2,1,2,1,2,3,4]])
s1

a  1    0
   2    1
b  1    2
   2    3
c  1    4
   2    5
d  1    6
   2    7
e  3    8
   4    9
dtype: int32

In [84]:
s1.unstack()

     1    2    3    4
a  0.0  1.0  NaN  NaN
b  2.0  3.0  NaN  NaN
c  4.0  5.0  NaN  NaN
d  6.0  7.0  NaN  NaN
e  NaN  NaN  8.0  9.0

In [86]:
s1.unstack().stack()

a  1    0.0
   2    1.0
b  1    2.0
   2    3.0
c  1    4.0
   2    5.0
d  1    6.0
   2    7.0
e  3    8.0
   4    9.0
dtype: float64

In [78]:
### 1. Write a Python program to find the maximum and minimum value of a given flattened array

In [88]:
a = np.array([[0,1],
              [2,3]])

In [89]:
a

array([[0, 1],
       [2, 3]])

In [92]:
np.max(a)

3

In [93]:
np.min(a)

0

In [94]:
np.max(a,axis =0)

array([2, 3])

In [95]:
np.min(a,axis = 0)

array([0, 1])

In [96]:
np.max(a,axis =1)

array([1, 3])

In [98]:
np.min(a,axis = 1)

array([0, 2])

In [99]:
a1 = a = np.array([[10,7,45],
                   [25,39,-98],
                   [-4,89,33]])

In [100]:
a1

array([[ 10,   7,  45],
       [ 25,  39, -98],
       [ -4,  89,  33]])

In [102]:
np.max(a1,axis = 0 )

array([25, 89, 45])

In [103]:
np.min(a1,axis = 1)

array([  7, -98,  -4])

In [105]:
np.sum(a1,axis =0)

array([ 31, 135, -20])

In [106]:
np.cumsum(a1,axis =0)

array([[ 10,   7,  45],
       [ 35,  46, -53],
       [ 31, 135, -20]], dtype=int32)

In [107]:
np.cumsum(a1,axis =1)

array([[ 10,  17,  62],
       [ 25,  64, -34],
       [ -4,  85, 118]], dtype=int32)

In [108]:
np.cumprod(a1,axis =0)

array([[     10,       7,      45],
       [    250,     273,   -4410],
       [  -1000,   24297, -145530]], dtype=int32)

### 1. Write a NumPy program to add, subtract, multiply, divide arguments element-wise

In [110]:
np.add(1,2)

3

In [111]:
np.subtract(2,3)

-1

In [112]:
x = np.array([-10.2, 122.2, .20])

In [113]:
x

array([-10.2, 122.2,   0.2])

In [114]:
np.absolute(x)

array([ 10.2, 122.2,   0.2])

In [115]:
x1 = [1., 2., 3., 4.]

In [116]:
x1

[1.0, 2.0, 3.0, 4.0]

In [117]:
np.floor_divide(x1,2.5)

array([0., 0., 1., 1.])

### Write a NumPy program to find the most frequent value in an array.

In [118]:
x = np.random.randint(0,10,40)

In [119]:
x

array([4, 0, 8, 9, 4, 0, 2, 0, 9, 5, 9, 6, 6, 7, 6, 6, 6, 1, 3, 2, 9, 4,
       3, 9, 1, 6, 8, 5, 8, 8, 5, 6, 9, 9, 7, 2, 4, 3, 5, 5])

In [120]:
np.bincount(x)

array([3, 2, 3, 3, 4, 5, 7, 2, 4, 7], dtype=int64)

In [ ]:
np